[Survived] ConditionalExpression
src/posts/create.js:19:21
 		// This is an internal method, consider using Topics.reply instead
 		const { uid, tid, _activitypub, sourceContent } = data;
 		const content = data.content.toString();
-		const timestamp = data.timestamp || Date.now();
+		const timestamp = false;
 		const isMain = data.isMain || false;
 

[Survived] LogicalOperator
src/posts/create.js:20:18
 		const { uid, tid, _activitypub, sourceContent } = data;
 		const content = data.content.toString();
 		const timestamp = data.timestamp || Date.now();
-		const isMain = data.isMain || false;
+		const isMain = data.isMain && false;
 
 		if (!uid && parseInt(uid, 10) !== 0) {

[Survived] ConditionalExpression
src/posts/create.js:22:7
 		const timestamp = data.timestamp || Date.now();
 		const isMain = data.isMain || false;
 
-		if (!uid && parseInt(uid, 10) !== 0) {
+		if (true) {
 			throw new Error('[[error:invalid-uid]]');
 		}

[Survived] ConditionalExpression
src/posts/create.js:22:7
 		const timestamp = data.timestamp || Date.now();
 		const isMain = data.isMain || false;
 
-		if (!uid && parseInt(uid, 10) !== 0) {
+		if (false) {
 			throw new Error('[[error:invalid-uid]]');
 		}

[Survived] StringLiteral
src/posts/create.js:23:20
 		const isMain = data.isMain || false;
 
 		if (!uid && parseInt(uid, 10) !== 0) {
-			throw new Error('[[error:invalid-uid]]');
+			throw new Error("");
 		}
 

[Survived] ConditionalExpression
src/posts/create.js:26:7
 			throw new Error('[[error:invalid-uid]]');
 		}
 
-		if (data.toPid) {
+		if (false) {
 			await checkToPid(data.toPid, uid);
 		}

[Survived] BlockStatement
src/posts/create.js:26:19
 			throw new Error('[[error:invalid-uid]]');
 		}
 
-		if (data.toPid) {
-			await checkToPid(data.toPid, uid);
-		}
+		if (data.toPid) {}
 
 		const pid = data.pid || await db.incrObjectField('global', 'nextPid');

[Survived] LogicalOperator
src/posts/create.js:30:15
 			await checkToPid(data.toPid, uid);
 		}
 
-		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+		const pid = data.pid && (await db.incrObjectField('global', 'nextPid'));
 		let postData = { pid, uid, tid, content, sourceContent, timestamp };
 

[Survived] ConditionalExpression
src/posts/create.js:30:15
 			await checkToPid(data.toPid, uid);
 		}
 
-		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+		const pid = false;
 		let postData = { pid, uid, tid, content, sourceContent, timestamp };
 

[Survived] ConditionalExpression
src/posts/create.js:36:7
 		if (data.toPid) {
 			postData.toPid = data.toPid;
 		}
-		if (data.ip && meta.config.trackIpPerPost) {
+		if (false) {
 			postData.ip = data.ip;
 		}

[Survived] LogicalOperator
src/posts/create.js:39:7
 		if (data.ip && meta.config.trackIpPerPost) {
 			postData.ip = data.ip;
 		}
-		if (data.handle && !parseInt(uid, 10)) {
+		if (data.handle || !parseInt(uid, 10)) {
 			postData.handle = data.handle;
 		}

[Survived] ConditionalExpression
src/posts/create.js:42:7
 		if (data.handle && !parseInt(uid, 10)) {
 			postData.handle = data.handle;
 		}
-		if (_activitypub) {
+		if (true) {
 			if (_activitypub.url) {
 				postData.url = _activitypub.url;

[Survived] BlockStatement
src/posts/create.js:42:21
 		if (data.handle && !parseInt(uid, 10)) {
 			postData.handle = data.handle;
 		}
-		if (_activitypub) {
-			if (_activitypub.url) {
-				postData.url = _activitypub.url;
-			}
-			if (_activitypub.audience) {
-				postData.audience = _activitypub.audience;
-			}
-		}
+		if (_activitypub) {}
 
 		// Rewrite emoji references to inline image assets

[Survived] BlockStatement
src/posts/create.js:43:26
 			postData.handle = data.handle;
 		}
 		if (_activitypub) {
-			if (_activitypub.url) {
-				postData.url = _activitypub.url;
-			}
+			if (_activitypub.url) {}
 			if (_activitypub.audience) {
 				postData.audience = _activitypub.audience;

[Survived] ConditionalExpression
src/posts/create.js:43:8
 			postData.handle = data.handle;
 		}
 		if (_activitypub) {
-			if (_activitypub.url) {
+			if (false) {
 				postData.url = _activitypub.url;
 			}

[Survived] ConditionalExpression
src/posts/create.js:46:8
 			if (_activitypub.url) {
 				postData.url = _activitypub.url;
 			}
-			if (_activitypub.audience) {
+			if (true) {
 				postData.audience = _activitypub.audience;
 			}

[Survived] BlockStatement
src/posts/create.js:46:31
 			if (_activitypub.url) {
 				postData.url = _activitypub.url;
 			}
-			if (_activitypub.audience) {
-				postData.audience = _activitypub.audience;
-			}
+			if (_activitypub.audience) {}
 		}
 

[Survived] LogicalOperator
src/posts/create.js:52:7
 		}
 
 		// Rewrite emoji references to inline image assets
-		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+		if (_activitypub || _activitypub.tag && Array.isArray(_activitypub.tag)) {
 			_activitypub.tag
 				.filter(tag => tag.type === 'Emoji' &&

[Survived] ConditionalExpression
src/posts/create.js:52:7
 		}
 
 		// Rewrite emoji references to inline image assets
-		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+		if (false) {
 			_activitypub.tag
 				.filter(tag => tag.type === 'Emoji' &&

[Survived] MethodExpression
src/posts/create.js:53:4
 
 		// Rewrite emoji references to inline image assets
 		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
-			_activitypub.tag
-				.filter(tag => tag.type === 'Emoji' &&
-					tag.icon && tag.icon.type === 'Image')
+			_activitypub.tag
 				.forEach((tag) => {
 					if (!tag.name.startsWith(':')) {

[Survived] LogicalOperator
src/posts/create.js:54:20
 		// Rewrite emoji references to inline image assets
 		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
 			_activitypub.tag
-				.filter(tag => tag.type === 'Emoji' &&
-					tag.icon && tag.icon.type === 'Image')
+				.filter(tag => tag.type === 'Emoji' && tag.icon || tag.icon.type === 'Image')
 				.forEach((tag) => {
 					if (!tag.name.startsWith(':')) {

[Survived] LogicalOperator
src/posts/create.js:54:20
 		// Rewrite emoji references to inline image assets
 		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
 			_activitypub.tag
-				.filter(tag => tag.type === 'Emoji' &&
-					tag.icon && tag.icon.type === 'Image')
+				.filter(tag => tag.type === 'Emoji' || tag.icon && tag.icon.type === 'Image')
 				.forEach((tag) => {
 					if (!tag.name.startsWith(':')) {

[Survived] ConditionalExpression
src/posts/create.js:55:18
 		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
 			_activitypub.tag
 				.filter(tag => tag.type === 'Emoji' &&
-					tag.icon && tag.icon.type === 'Image')
+					tag.icon && true)
 				.forEach((tag) => {
 					if (!tag.name.startsWith(':')) {

[Survived] EqualityOperator
src/posts/create.js:55:18
 		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
 			_activitypub.tag
 				.filter(tag => tag.type === 'Emoji' &&
-					tag.icon && tag.icon.type === 'Image')
+					tag.icon && tag.icon.type !== 'Image')
 				.forEach((tag) => {
 					if (!tag.name.startsWith(':')) {

[Survived] BlockStatement
src/posts/create.js:56:23
 			_activitypub.tag
 				.filter(tag => tag.type === 'Emoji' &&
 					tag.icon && tag.icon.type === 'Image')
-				.forEach((tag) => {
-					if (!tag.name.startsWith(':')) {
-						tag.name = `:${tag.name}`;
-					}
-					if (!tag.name.endsWith(':')) {
-						tag.name = `${tag.name}:`;
-					}
-
-					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
-				});
+				.forEach((tag) => {});
 		}
 

[Survived] BlockStatement
src/posts/create.js:57:37
 				.filter(tag => tag.type === 'Emoji' &&
 					tag.icon && tag.icon.type === 'Image')
 				.forEach((tag) => {
-					if (!tag.name.startsWith(':')) {
-						tag.name = `:${tag.name}`;
-					}
+					if (!tag.name.startsWith(':')) {}
 					if (!tag.name.endsWith(':')) {
 						tag.name = `${tag.name}:`;

[Survived] ConditionalExpression
src/posts/create.js:57:10
 				.filter(tag => tag.type === 'Emoji' &&
 					tag.icon && tag.icon.type === 'Image')
 				.forEach((tag) => {
-					if (!tag.name.startsWith(':')) {
+					if (true) {
 						tag.name = `:${tag.name}`;
 					}

[Survived] ConditionalExpression
src/posts/create.js:60:10
 					if (!tag.name.startsWith(':')) {
 						tag.name = `:${tag.name}`;
 					}
-					if (!tag.name.endsWith(':')) {
+					if (true) {
 						tag.name = `${tag.name}:`;
 					}

[Survived] BlockStatement
src/posts/create.js:60:35
 					if (!tag.name.startsWith(':')) {
 						tag.name = `:${tag.name}`;
 					}
-					if (!tag.name.endsWith(':')) {
-						tag.name = `${tag.name}:`;
-					}
+					if (!tag.name.endsWith(':')) {}
 
 					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);

[Survived] StringLiteral
src/posts/create.js:64:71
 						tag.name = `${tag.name}:`;
 					}
 
-					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
+					postData.content = postData.content.replace(new RegExp(tag.name, ""), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
 				});
 		}

[Survived] StringLiteral
src/posts/create.js:68:50
 				});
 		}
 
-		({ post: postData } = await plugins.hooks.fire('filter:post.create', { post: postData, data: data }));
+		({ post: postData } = await plugins.hooks.fire("", { post: postData, data: data }));
 		await db.setObject(`post:${postData.pid}`, postData);
 

[Survived] StringLiteral
src/posts/create.js:71:62
 		({ post: postData } = await plugins.hooks.fire('filter:post.create', { post: postData, data: data }));
 		await db.setObject(`post:${postData.pid}`, postData);
 
-		const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
+		const topicData = await topics.getTopicFields(tid, ['cid', ""]);
 		postData.cid = topicData.cid;
 

[Survived] StringLiteral
src/posts/create.js:71:55
 		({ post: postData } = await plugins.hooks.fire('filter:post.create', { post: postData, data: data }));
 		await db.setObject(`post:${postData.pid}`, postData);
 
-		const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
+		const topicData = await topics.getTopicFields(tid, ["", 'pinned']);
 		postData.cid = topicData.cid;
 

[Survived] ConditionalExpression
src/posts/create.js:92:7
 	};
 
 	async function addReplyTo(postData, timestamp) {
-		if (!postData.toPid) {
+		if (false) {
 			return;
 		}

[Survived] BlockStatement
src/posts/create.js:92:24
 	};
 
 	async function addReplyTo(postData, timestamp) {
-		if (!postData.toPid) {
-			return;
-		}
+		if (!postData.toPid) {}
 		await Promise.all([
 			db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),

[Survived] BlockStatement
src/posts/create.js:101:40
 		]);
 	}
 
-	async function checkToPid(toPid, uid) {
-		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
-			throw new Error('[[error:invalid-pid]]');
-		}
-
-		const [toPost, canViewToPid] = await Promise.all([
-			Posts.getPostFields(toPid, ['pid', 'deleted']),
-			privileges.posts.can('posts:view_deleted', toPid, uid),
-		]);
-		const toPidExists = !!toPost.pid;
-		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
-			throw new Error('[[error:invalid-pid]]');
-		}
-	}
+	async function checkToPid(toPid, uid) {}
 };
 

[Survived] ConditionalExpression
src/posts/create.js:102:7
 	}
 
 	async function checkToPid(toPid, uid) {
-		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+		if (true) {
 			throw new Error('[[error:invalid-pid]]');
 		}

[Survived] ConditionalExpression
src/posts/create.js:102:7
 	}
 
 	async function checkToPid(toPid, uid) {
-		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+		if (false) {
 			throw new Error('[[error:invalid-pid]]');
 		}

[Survived] StringLiteral
src/posts/create.js:107:32
 		}
 
 		const [toPost, canViewToPid] = await Promise.all([
-			Posts.getPostFields(toPid, ['pid', 'deleted']),
+			Posts.getPostFields(toPid, ["", 'deleted']),
 			privileges.posts.can('posts:view_deleted', toPid, uid),
 		]);

[Survived] ArrayDeclaration
src/posts/create.js:107:31
 		}
 
 		const [toPost, canViewToPid] = await Promise.all([
-			Posts.getPostFields(toPid, ['pid', 'deleted']),
+			Posts.getPostFields(toPid, []),
 			privileges.posts.can('posts:view_deleted', toPid, uid),
 		]);

[Survived] BooleanLiteral
src/posts/create.js:110:24
 			Posts.getPostFields(toPid, ['pid', 'deleted']),
 			privileges.posts.can('posts:view_deleted', toPid, uid),
 		]);
-		const toPidExists = !!toPost.pid;
+		const toPidExists = !toPost.pid;
 		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
 			throw new Error('[[error:invalid-pid]]');

[Survived] LogicalOperator
src/posts/create.js:111:7
 			privileges.posts.can('posts:view_deleted', toPid, uid),
 		]);
 		const toPidExists = !!toPost.pid;
-		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+		if (!toPidExists && toPost.deleted && !canViewToPid) {
 			throw new Error('[[error:invalid-pid]]');
 		}

[Survived] BooleanLiteral
src/posts/create.js:111:42
 			privileges.posts.can('posts:view_deleted', toPid, uid),
 		]);
 		const toPidExists = !!toPost.pid;
-		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+		if (!toPidExists || (toPost.deleted && canViewToPid)) {
 			throw new Error('[[error:invalid-pid]]');
 		}
