[Survived] StringLiteral
src/posts/data.js:8:16
 const utils = require('../utils');
 
 const intFields = [
-	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+	'uid', 'pid', "", 'deleted', 'timestamp',
 	'upvotes', 'downvotes', 'deleterUid', 'edited',
 	'replies', 'bookmarks', 'announces',

[Survived] StringLiteral
src/posts/data.js:9:2
 
 const intFields = [
 	'uid', 'pid', 'tid', 'deleted', 'timestamp',
-	'upvotes', 'downvotes', 'deleterUid', 'edited',
+	"", 'downvotes', 'deleterUid', 'edited',
 	'replies', 'bookmarks', 'announces',
 ];

[Survived] StringLiteral
src/posts/data.js:9:26
 
 const intFields = [
 	'uid', 'pid', 'tid', 'deleted', 'timestamp',
-	'upvotes', 'downvotes', 'deleterUid', 'edited',
+	'upvotes', 'downvotes', "", 'edited',
 	'replies', 'bookmarks', 'announces',
 ];

[Survived] StringLiteral
src/posts/data.js:10:2
 const intFields = [
 	'uid', 'pid', 'tid', 'deleted', 'timestamp',
 	'upvotes', 'downvotes', 'deleterUid', 'edited',
-	'replies', 'bookmarks', 'announces',
+	"", 'bookmarks', 'announces',
 ];
 

[Survived] StringLiteral
src/posts/data.js:10:26
 const intFields = [
 	'uid', 'pid', 'tid', 'deleted', 'timestamp',
 	'upvotes', 'downvotes', 'deleterUid', 'edited',
-	'replies', 'bookmarks', 'announces',
+	'replies', 'bookmarks', "",
 ];
 

[Survived] LogicalOperator
src/posts/data.js:15:7
 
 module.exports = function (Posts) {
 	Posts.getPostsFields = async function (pids, fields) {
-		if (!Array.isArray(pids) || !pids.length) {
+		if (!Array.isArray(pids) && !pids.length) {
 			return [];
 		}

[Survived] StringLiteral
src/posts/data.js:20:43
 		}
 		const keys = pids.map(pid => `post:${pid}`);
 		const postData = await db.getObjects(keys, fields);
-		const result = await plugins.hooks.fire('filter:post.getFields', {
+		const result = await plugins.hooks.fire("", {
 			pids: pids,
 			posts: postData,

[Survived] ArrayDeclaration
src/posts/data.js:30:44
 	};
 
 	Posts.getPostData = async function (pid) {
-		const posts = await Posts.getPostsFields([pid], []);
+		const posts = await Posts.getPostsFields([], []);
 		return posts && posts.length ? posts[0] : null;
 	};

[Survived] ConditionalExpression
src/posts/data.js:31:10
 
 	Posts.getPostData = async function (pid) {
 		const posts = await Posts.getPostsFields([pid], []);
-		return posts && posts.length ? posts[0] : null;
+		return true ? posts[0] : null;
 	};
 

[Survived] BlockStatement
src/posts/data.js:38:51
 		return await Posts.getPostsFields(pids, []);
 	};
 
-	Posts.getPostField = async function (pid, field) {
-		const post = await Posts.getPostFields(pid, [field]);
-		return post && post.hasOwnProperty(field) ? post[field] : null;
-	};
+	Posts.getPostField = async function (pid, field) {};
 
 	Posts.getPostFields = async function (pid, fields) {

[Survived] LogicalOperator
src/posts/data.js:40:10
 
 	Posts.getPostField = async function (pid, field) {
 		const post = await Posts.getPostFields(pid, [field]);
-		return post && post.hasOwnProperty(field) ? post[field] : null;
+		return post || post.hasOwnProperty(field) ? post[field] : null;
 	};
 

[Survived] ConditionalExpression
src/posts/data.js:40:10
 
 	Posts.getPostField = async function (pid, field) {
 		const post = await Posts.getPostFields(pid, [field]);
-		return post && post.hasOwnProperty(field) ? post[field] : null;
+		return false ? post[field] : null;
 	};
 

[Survived] BlockStatement
src/posts/data.js:58:35
 	};
 };
 
-function modifyPost(post, fields) {
-	if (post) {
-		db.parseIntFields(post, intFields, fields);
-		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-			post.votes = post.upvotes - post.downvotes;
-		}
-		if (post.hasOwnProperty('timestamp')) {
-			post.timestampISO = utils.toISOString(post.timestamp);
-		}
-		if (post.hasOwnProperty('edited')) {
-			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-		}
-		if (!fields.length || fields.includes('attachments')) {
-			post.attachments = (post.attachments || '').split(',').filter(Boolean);
-		}
-	}
-}
+function modifyPost(post, fields) {}
 

[Survived] BlockStatement
src/posts/data.js:59:12
 };
 
 function modifyPost(post, fields) {
-	if (post) {
-		db.parseIntFields(post, intFields, fields);
-		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-			post.votes = post.upvotes - post.downvotes;
-		}
-		if (post.hasOwnProperty('timestamp')) {
-			post.timestampISO = utils.toISOString(post.timestamp);
-		}
-		if (post.hasOwnProperty('edited')) {
-			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-		}
-		if (!fields.length || fields.includes('attachments')) {
-			post.attachments = (post.attachments || '').split(',').filter(Boolean);
-		}
-	}
+	if (post) {}
 }
 

[Survived] BlockStatement
src/posts/data.js:61:75
 function modifyPost(post, fields) {
 	if (post) {
 		db.parseIntFields(post, intFields, fields);
-		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-			post.votes = post.upvotes - post.downvotes;
-		}
+		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {}
 		if (post.hasOwnProperty('timestamp')) {
 			post.timestampISO = utils.toISOString(post.timestamp);

[Survived] ConditionalExpression
src/posts/data.js:61:7
 function modifyPost(post, fields) {
 	if (post) {
 		db.parseIntFields(post, intFields, fields);
-		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+		if (true) {
 			post.votes = post.upvotes - post.downvotes;
 		}

[Survived] ConditionalExpression
src/posts/data.js:67:7
 		if (post.hasOwnProperty('timestamp')) {
 			post.timestampISO = utils.toISOString(post.timestamp);
 		}
-		if (post.hasOwnProperty('edited')) {
+		if (true) {
 			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
 		}

[Survived] EqualityOperator
src/posts/data.js:68:21
 			post.timestampISO = utils.toISOString(post.timestamp);
 		}
 		if (post.hasOwnProperty('edited')) {
-			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+			post.editedISO = post.edited === 0 ? utils.toISOString(post.edited) : '';
 		}
 		if (!fields.length || fields.includes('attachments')) {

[Survived] BooleanLiteral
src/posts/data.js:70:7
 		if (post.hasOwnProperty('edited')) {
 			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
 		}
-		if (!fields.length || fields.includes('attachments')) {
+		if (fields.length || fields.includes('attachments')) {
 			post.attachments = (post.attachments || '').split(',').filter(Boolean);
 		}

[Survived] LogicalOperator
src/posts/data.js:70:7
 		if (post.hasOwnProperty('edited')) {
 			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
 		}
-		if (!fields.length || fields.includes('attachments')) {
+		if (!fields.length && fields.includes('attachments')) {
 			post.attachments = (post.attachments || '').split(',').filter(Boolean);
 		}

[Survived] ConditionalExpression
src/posts/data.js:71:24
 			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
 		}
 		if (!fields.length || fields.includes('attachments')) {
-			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+			post.attachments = (false).split(',').filter(Boolean);
 		}
 	}

[Survived] MethodExpression
src/posts/data.js:71:23
 			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
 		}
 		if (!fields.length || fields.includes('attachments')) {
-			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+			post.attachments = (post.attachments || '').split(',');
 		}
 	}
