[Survived] StringLiteral
src/posts/delete.js:21:32
 	};
 
 	Posts.restore = async function (pid, uid) {
-		return await deleteOrRestore('restore', pid, uid);
+		return await deleteOrRestore("", pid, uid);
 	};
 

[Survived] BlockStatement
src/posts/delete.js:24:49
 		return await deleteOrRestore('restore', pid, uid);
 	};
 
-	async function deleteOrRestore(type, pid, uid) {
-		const isDeleting = type === 'delete';
-		await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
-		await Posts.setPostFields(pid, {
-			deleted: isDeleting ? 1 : 0,
-			deleterUid: isDeleting ? uid : 0,
-		});
-		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
-		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
-		postData.cid = topicData.cid;
-		await Promise.all([
-			topics.updateLastPostTimeFromLastPid(postData.tid),
-			topics.updateTeaser(postData.tid),
-			isDeleting ?
-				db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
-				db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
-		]);
-		await categories.updateRecentTidForCid(postData.cid);
-		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-		if (type === 'delete') {
-			await flags.resolveFlag('post', pid, uid);
-		}
-		return postData;
-	}
+	async function deleteOrRestore(type, pid, uid) {}
 
 	Posts.purge = async function (pids, uid) {

[Survived] ArrayDeclaration
src/posts/delete.js:31:51
 			deleted: isDeleting ? 1 : 0,
 			deleterUid: isDeleting ? uid : 0,
 		});
-		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+		const postData = await Posts.getPostFields(pid, []);
 		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
 		postData.cid = topicData.cid;

[Survived] StringLiteral
src/posts/delete.js:31:97
 			deleted: isDeleting ? 1 : 0,
 			deleterUid: isDeleting ? uid : 0,
 		});
-		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', ""]);
 		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
 		postData.cid = topicData.cid;

[Survived] ArrayDeclaration
src/posts/delete.js:32:63
 			deleterUid: isDeleting ? uid : 0,
 		});
 		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
-		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+		const topicData = await topics.getTopicFields(postData.tid, []);
 		postData.cid = topicData.cid;
 		await Promise.all([

[Survived] ArrayDeclaration
src/posts/delete.js:34:21
 		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
 		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
 		postData.cid = topicData.cid;
-		await Promise.all([
-			topics.updateLastPostTimeFromLastPid(postData.tid),
-			topics.updateTeaser(postData.tid),
-			isDeleting ?
-				db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
-				db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
-		]);
+		await Promise.all([]);
 		await categories.updateRecentTidForCid(postData.cid);
 		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });

[Survived] ConditionalExpression
src/posts/delete.js:43:7
 		]);
 		await categories.updateRecentTidForCid(postData.cid);
 		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-		if (type === 'delete') {
+		if (false) {
 			await flags.resolveFlag('post', pid, uid);
 		}

[Survived] StringLiteral
src/posts/delete.js:44:28
 		await categories.updateRecentTidForCid(postData.cid);
 		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
 		if (type === 'delete') {
-			await flags.resolveFlag('post', pid, uid);
+			await flags.resolveFlag("", pid, uid);
 		}
 		return postData;

[Survived] MethodExpression
src/posts/delete.js:52:10
 	Posts.purge = async function (pids, uid) {
 		pids = Array.isArray(pids) ? pids : [pids];
 		let postData = await Posts.getPostsData(pids);
-		pids = pids.filter((pid, index) => !!postData[index]);
+		pids = pids;
 		postData = postData.filter(Boolean);
 		if (!postData.length) {

[Survived] ConditionalExpression
src/posts/delete.js:54:7
 		let postData = await Posts.getPostsData(pids);
 		pids = pids.filter((pid, index) => !!postData[index]);
 		postData = postData.filter(Boolean);
-		if (!postData.length) {
+		if (false) {
 			return;
 		}

[Survived] ConditionalExpression
src/posts/delete.js:54:7
 		let postData = await Posts.getPostsData(pids);
 		pids = pids.filter((pid, index) => !!postData[index]);
 		postData = postData.filter(Boolean);
-		if (!postData.length) {
+		if (true) {
 			return;
 		}

[Survived] StringLiteral
src/posts/delete.js:58:68
 			return;
 		}
 		const uniqTids = _.uniq(postData.map(p => p.tid));
-		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+		const topicData = await topics.getTopicsFields(uniqTids, ['tid', "", 'pinned', 'postcount']);
 		const tidToTopic = _.zipObject(uniqTids, topicData);
 

[Survived] ConditionalExpression
src/posts/delete.js:63:12
 
 		postData.forEach((p) => {
 			p.topic = tidToTopic[p.tid];
-			p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+			p.cid = false;
 		});
 

[Survived] ArrayDeclaration
src/posts/delete.js:72:21
 			uid: uid,
 		});
 
-		await Promise.all([
-			deleteFromTopicUserNotification(postData),
-			deleteFromCategoryRecentPosts(postData),
-			deleteFromUsersBookmarks(pids),
-			deleteFromUsersVotes(pids),
-			deleteFromReplies(postData),
-			deleteFromGroups(pids),
-			deleteDiffs(pids),
-			deleteFromUploads(pids),
-			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
-			Posts.attachments.empty(pids),
-			activitypub.notes.delete(pids),
-			db.deleteAll(pids.map(pid => `pid:${pid}:editors`)),
-		]);
+		await Promise.all([]);
 
 		await resolveFlags(postData, uid);

[Survived] StringLiteral
src/posts/delete.js:81:25
 			deleteFromGroups(pids),
 			deleteDiffs(pids),
 			deleteFromUploads(pids),
-			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
+			db.sortedSetsRemove(["", 'posts:votes', 'posts:flagged'], pids),
 			Posts.attachments.empty(pids),
 			activitypub.notes.delete(pids),

[Survived] ArrowFunction
src/posts/delete.js:84:26
 			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
 			Posts.attachments.empty(pids),
 			activitypub.notes.delete(pids),
-			db.deleteAll(pids.map(pid => `pid:${pid}:editors`)),
+			db.deleteAll(pids.map(() => undefined)),
 		]);
 

[Survived] StringLiteral
src/posts/delete.js:98:21
 		const bulkRemove = [];
 		postData.forEach((p) => {
 			bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
-			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
+			bulkRemove.push([``, p.pid]);
 			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
 			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);

[Survived] StringLiteral
src/posts/delete.js:99:21
 		postData.forEach((p) => {
 			bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
 			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
-			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
+			bulkRemove.push([``, p.pid]);
 			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
 			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);

[Survived] ArrayDeclaration
src/posts/delete.js:101:20
 			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
 			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
 			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
-			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
+			bulkRemove.push([]);
 		});
 		await db.sortedSetRemoveBulk(bulkRemove);

[Survived] MethodExpression
src/posts/delete.js:105:22
 		});
 		await db.sortedSetRemoveBulk(bulkRemove);
 
-		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
+		const localCount = postData.length;
 		const incrObjectBulk = [['global', { postCount: -localCount }]];
 

[Survived] ArrowFunction
src/posts/delete.js:105:38
 		});
 		await db.sortedSetRemoveBulk(bulkRemove);
 
-		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
+		const localCount = postData.filter(() => undefined).length;
 		const incrObjectBulk = [['global', { postCount: -localCount }]];
 

[Survived] UnaryOperator
src/posts/delete.js:106:51
 		await db.sortedSetRemoveBulk(bulkRemove);
 
 		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
-		const incrObjectBulk = [['global', { postCount: -localCount }]];
+		const incrObjectBulk = [['global', { postCount: +localCount }]];
 
 		const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));

[Survived] ObjectLiteral
src/posts/delete.js:106:38
 		await db.sortedSetRemoveBulk(bulkRemove);
 
 		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
-		const incrObjectBulk = [['global', { postCount: -localCount }]];
+		const incrObjectBulk = [['global', {}]];
 
 		const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));

[Survived] ArrowFunction
src/posts/delete.js:113:44
 			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
 		}
 
-		const postsByTopic = _.groupBy(postData, p => String(p.tid));
+		const postsByTopic = _.groupBy(postData, () => undefined);
 		const topicPostCountTasks = [];
 		const topicTasks = [];

[Survived] ArrayDeclaration
src/posts/delete.js:114:31
 		}
 
 		const postsByTopic = _.groupBy(postData, p => String(p.tid));
-		const topicPostCountTasks = [];
+		const topicPostCountTasks = ["Stryker was here"];
 		const topicTasks = [];
 		const zsetIncrBulk = [];

[Survived] BlockStatement
src/posts/delete.js:118:60
 		const topicTasks = [];
 		const zsetIncrBulk = [];
 		const tids = [];
-		for (const [tid, posts] of Object.entries(postsByTopic)) {
-			tids.push(tid);
-			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
-			if (posts.length && posts[0]) {
-				const topicData = posts[0].topic;
-				const newPostCount = topicData.postcount - posts.length;
-				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-				if (!topicData.pinned) {
-					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-				}
-			}
-			topicTasks.push(topics.updateTeaser(tid));
-			topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
-			const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
-			for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
-			}
-			topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
-		}
+		for (const [tid, posts] of Object.entries(postsByTopic)) {}
 
 		await Promise.all([

[Survived] UnaryOperator
src/posts/delete.js:120:54
 		const tids = [];
 		for (const [tid, posts] of Object.entries(postsByTopic)) {
 			tids.push(tid);
-			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+			incrObjectBulk.push([`topic:${tid}`, { postcount: +posts.length }]);
 			if (posts.length && posts[0]) {
 				const topicData = posts[0].topic;

[Survived] ObjectLiteral
src/posts/delete.js:120:41
 		const tids = [];
 		for (const [tid, posts] of Object.entries(postsByTopic)) {
 			tids.push(tid);
-			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+			incrObjectBulk.push([`topic:${tid}`, {}]);
 			if (posts.length && posts[0]) {
 				const topicData = posts[0].topic;

[Survived] BooleanLiteral
src/posts/delete.js:125:9
 				const topicData = posts[0].topic;
 				const newPostCount = topicData.postcount - posts.length;
 				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-				if (!topicData.pinned) {
+				if (topicData.pinned) {
 					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
 				}

[Survived] ConditionalExpression
src/posts/delete.js:125:9
 				const topicData = posts[0].topic;
 				const newPostCount = topicData.postcount - posts.length;
 				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-				if (!topicData.pinned) {
+				if (true) {
 					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
 				}

[Survived] StringLiteral
src/posts/delete.js:143:47
 			db.sortedSetAddBulk(topicPostCountTasks),
 			...topicTasks,
 			user.updatePostCount(_.uniq(postData.map(p => p.uid))),
-			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
+			notifications.rescind(...postData.map(p => ``)),
 		]);
 		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);

[Survived] ArrowFunction
src/posts/delete.js:145:35
 			user.updatePostCount(_.uniq(postData.map(p => p.uid))),
 			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
 		]);
-		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);
+		const tidPosterZsets = tids.map(() => undefined);
 		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, '-inf', 0);
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);

[Survived] StringLiteral
src/posts/delete.js:145:42
 			user.updatePostCount(_.uniq(postData.map(p => p.uid))),
 			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
 		]);
-		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);
+		const tidPosterZsets = tids.map(tid => ``);
 		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, '-inf', 0);
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);

[Survived] StringLiteral
src/posts/delete.js:146:57
 			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
 		]);
 		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);
-		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, '-inf', 0);
+		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, "", 0);
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);
 		await db.setObjectBulk(

[Survived] ArrowFunction
src/posts/delete.js:149:13
 		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, '-inf', 0);
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);
 		await db.setObjectBulk(
-			tids.map((tid, idx) => (
-				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
-			))
+			tids.map(() => undefined)
 		);
 	}

[Survived] ConditionalExpression
src/posts/delete.js:150:37
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);
 		await db.setObjectBulk(
 			tids.map((tid, idx) => (
-				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+				[`topic:${tid}`, { postercount: true }]
 			))
 		);

[Survived] ConditionalExpression
src/posts/delete.js:150:37
 		const posterCounts = await db.sortedSetsCard(tidPosterZsets);
 		await db.setObjectBulk(
 			tids.map((tid, idx) => (
-				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+				[`topic:${tid}`, { postercount: false }]
 			))
 		);

[Survived] ArrayDeclaration
src/posts/delete.js:164:22
 
 	async function deleteFromUsersBookmarks(pids) {
 		const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
-		const bulkRemove = [];
+		const bulkRemove = ["Stryker was here"];
 		pids.forEach((pid, index) => {
 			arrayOfUids[index].forEach((uid) => {

[Survived] StringLiteral
src/posts/delete.js:177:38
 	async function deleteFromUsersVotes(pids) {
 		const [upvoters, downvoters] = await Promise.all([
 			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
+			db.getSetsMembers(pids.map(pid => ``)),
 		]);
 		const bulkRemove = [];

[Survived] ArrayDeclaration
src/posts/delete.js:179:22
 			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
 			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
 		]);
-		const bulkRemove = [];
+		const bulkRemove = ["Stryker was here"];
 		pids.forEach((pid, index) => {
 			upvoters[index].forEach((upvoterUid) => {

[Survived] ArrayDeclaration
src/posts/delete.js:185:21
 				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
 			});
 			downvoters[index].forEach((downvoterUid) => {
-				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
+				bulkRemove.push([]);
 			});
 		});

[Survived] StringLiteral
src/posts/delete.js:192:24
 		await Promise.all([
 			db.sortedSetRemoveBulk(bulkRemove),
 			db.deleteAll([
-				...pids.map(pid => `pid:${pid}:upvote`),
+				...pids.map(pid => ``),
 				...pids.map(pid => `pid:${pid}:downvote`),
 			]),

[Survived] ArrayDeclaration
src/posts/delete.js:201:20
 	async function deleteFromReplies(postData) {
 		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
 		const allReplyPids = _.flatten(arrayOfReplyPids);
-		const promises = [
-			db.deleteObjectFields(
-				allReplyPids.map(pid => `post:${pid}`), ['toPid']
-			),
-			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
-		];
+		const promises = [];
 
 		const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));

[Survived] ArrayDeclaration
src/posts/delete.js:203:45
 		const allReplyPids = _.flatten(arrayOfReplyPids);
 		const promises = [
 			db.deleteObjectFields(
-				allReplyPids.map(pid => `post:${pid}`), ['toPid']
+				allReplyPids.map(pid => `post:${pid}`), []
 			),
 			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),

[Survived] StringLiteral
src/posts/delete.js:215:58
 
 		const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
 		const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
-		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+		await db.setObjectBulk(parentPids.map((pid, index) => [``, { replies: counts[index] }]));
 	}
 

[Survived] StringLiteral
src/posts/delete.js:227:23
 	async function deleteDiffs(pids) {
 		const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
 		await db.deleteAll([
-			...pids.map(pid => `post:${pid}:diffs`),
+			...pids.map(pid => ``),
 			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
 		]);

[Survived] BlockStatement
src/posts/delete.js:236:45
 		await Promise.all(pids.map(Posts.uploads.dissociateAll));
 	}
 
-	async function resolveFlags(postData, uid) {
-		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
-		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
-	}
+	async function resolveFlags(postData, uid) {}
 };
 

[Survived] MethodExpression
src/posts/delete.js:237:24
 	}
 
 	async function resolveFlags(postData, uid) {
-		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+		const flaggedPosts = postData;
 		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
 	}

[Survived] ConditionalExpression
src/posts/delete.js:237:45
 	}
 
 	async function resolveFlags(postData, uid) {
-		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+		const flaggedPosts = postData.filter(p => false);
 		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
 	}

[Survived] ArrowFunction
src/posts/delete.js:238:38
 
 	async function resolveFlags(postData, uid) {
 		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
-		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+		await Promise.all(flaggedPosts.map(() => undefined));
 	}
 };

[Survived] ObjectLiteral
src/posts/delete.js:238:71
 
 	async function resolveFlags(postData, uid) {
 		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
-		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, {})));
 	}
 };
