[Survived] ConditionalExpression
src/posts/create.js:30:15
-   		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+   		const pid = true;

[Survived] ConditionalExpression
src/posts/create.js:30:15
-   		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+   		const pid = false;

[Survived] LogicalOperator
src/posts/create.js:30:15
-   		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+   		const pid = data.pid && (await db.incrObjectField('global', 'nextPid'));

[Survived] StringLiteral
src/posts/create.js:30:52
-   		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+   		const pid = data.pid || await db.incrObjectField("", 'nextPid');

[Survived] StringLiteral
src/posts/create.js:30:62
-   		const pid = data.pid || await db.incrObjectField('global', 'nextPid');
+   		const pid = data.pid || await db.incrObjectField('global', "");

[Survived] StringLiteral
src/posts/create.js:76:45
-   			utils.isNumber(pid) ? db.incrObjectField('global', 'postCount') : null,
+   			utils.isNumber(pid) ? db.incrObjectField("", 'postCount') : null,

[Survived] StringLiteral
src/posts/create.js:76:55
-   			utils.isNumber(pid) ? db.incrObjectField('global', 'postCount') : null,
+   			utils.isNumber(pid) ? db.incrObjectField('global', "") : null,

[Survived] StringLiteral
src/posts/create.js:97:23
-   			db.incrObjectField(`post:${postData.toPid}`, 'replies'),
+   			db.incrObjectField(``, 'replies'),

[Survived] StringLiteral
src/posts/create.js:97:49
-   			db.incrObjectField(`post:${postData.toPid}`, 'replies'),
+   			db.incrObjectField(`post:${postData.toPid}`, ""),

[Survived] BlockStatement
src/posts/create.js:101:40
-   	async function checkToPid(toPid, uid) {
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
-   			throw new Error('[[error:invalid-pid]]');
-   		}
-   		const [toPost, canViewToPid] = await Promise.all([
-   			Posts.getPostFields(toPid, ['pid', 'deleted']),
-   			privileges.posts.can('posts:view_deleted', toPid, uid),
-   		]);
-   		const toPidExists = !!toPost.pid;
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
-   			throw new Error('[[error:invalid-pid]]');
-   		}
-   	}
+   	async function checkToPid(toPid, uid) {}

[Survived] ArrayDeclaration
src/posts/create.js:106:52
-   		const [toPost, canViewToPid] = await Promise.all([
-   			Posts.getPostFields(toPid, ['pid', 'deleted']),
-   			privileges.posts.can('posts:view_deleted', toPid, uid),
-   		]);
+   		const [toPost, canViewToPid] = await Promise.all([]);

[Survived] StringLiteral
src/posts/create.js:108:25
-   			privileges.posts.can('posts:view_deleted', toPid, uid),
+   			privileges.posts.can("", toPid, uid),

[Survived] ArrayDeclaration
src/posts/delete.js:138:21
-   		await Promise.all([
-   			db.incrObjectFieldByBulk(incrObjectBulk),
-   			db.sortedSetAddBulk(topicPostCountTasks),
-   			...topicTasks,
-   			user.updatePostCount(_.uniq(postData.map(p => p.uid))),
-   			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
-   		]);
+   		await Promise.all([]);

[Survived] ArrayDeclaration
src/posts/delete.js:201:20
-   		const promises = [
-   			db.deleteObjectFields(
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
-   			),
-   			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
-   		];
+   		const promises = [];
