[Survived] ConditionalExpression
src/posts/create.js:19:21
-   		const timestamp = data.timestamp || Date.now();
+   		const timestamp = true;

[Survived] ConditionalExpression
src/posts/create.js:19:21
-   		const timestamp = data.timestamp || Date.now();
+   		const timestamp = false;

[Survived] LogicalOperator
src/posts/create.js:19:21
-   		const timestamp = data.timestamp || Date.now();
+   		const timestamp = data.timestamp && Date.now();

[Survived] ConditionalExpression
src/posts/create.js:20:18
-   		const isMain = data.isMain || false;
+   		const isMain = false;

[Survived] ConditionalExpression
src/posts/create.js:20:18
-   		const isMain = data.isMain || false;
+   		const isMain = true;

[Survived] LogicalOperator
src/posts/create.js:20:18
-   		const isMain = data.isMain || false;
+   		const isMain = data.isMain && false;

[Survived] BooleanLiteral
src/posts/create.js:20:33
-   		const isMain = data.isMain || false;
+   		const isMain = data.isMain || true;

[Survived] ConditionalExpression
src/posts/create.js:22:7
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:22:7
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:22:7
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (!uid || parseInt(uid, 10) !== 0) {

[Survived] BooleanLiteral
src/posts/create.js:22:7
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (uid && parseInt(uid, 10) !== 0) {

[Survived] ConditionalExpression
src/posts/create.js:22:15
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (!uid && true) {

[Survived] EqualityOperator
src/posts/create.js:22:15
-   		if (!uid && parseInt(uid, 10) !== 0) {
+   		if (!uid && parseInt(uid, 10) === 0) {

[Survived] BlockStatement
src/posts/create.js:22:40
-   		if (!uid && parseInt(uid, 10) !== 0) {
-   			throw new Error('[[error:invalid-uid]]');
-   		}
+   		if (!uid && parseInt(uid, 10) !== 0) {}

[Survived] StringLiteral
src/posts/create.js:23:20
-   			throw new Error('[[error:invalid-uid]]');
+   			throw new Error("");

[Survived] ConditionalExpression
src/posts/create.js:26:7
-   		if (data.toPid) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:26:7
-   		if (data.toPid) {
+   		if (false) {

[Survived] BlockStatement
src/posts/create.js:26:19
-   		if (data.toPid) {
-   			await checkToPid(data.toPid, uid);
-   		}
+   		if (data.toPid) {}

[Survived] ConditionalExpression
src/posts/create.js:33:7
-   		if (data.toPid) {
+   		if (true) {

[Survived] ObjectLiteral
src/posts/create.js:31:18
-   		let postData = { pid, uid, tid, content, sourceContent, timestamp };
+   		let postData = {};

[Survived] ConditionalExpression
src/posts/create.js:33:7
-   		if (data.toPid) {
+   		if (false) {

[Survived] BlockStatement
src/posts/create.js:33:19
-   		if (data.toPid) {
-   			postData.toPid = data.toPid;
-   		}
+   		if (data.toPid) {}

[Survived] ConditionalExpression
src/posts/create.js:36:7
-   		if (data.ip && meta.config.trackIpPerPost) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:36:7
-   		if (data.ip && meta.config.trackIpPerPost) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:36:7
-   		if (data.ip && meta.config.trackIpPerPost) {
+   		if (data.ip || meta.config.trackIpPerPost) {

[Survived] BlockStatement
src/posts/create.js:36:46
-   		if (data.ip && meta.config.trackIpPerPost) {
-   			postData.ip = data.ip;
-   		}
+   		if (data.ip && meta.config.trackIpPerPost) {}

[Survived] ConditionalExpression
src/posts/create.js:39:7
-   		if (data.handle && !parseInt(uid, 10)) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:39:7
-   		if (data.handle && !parseInt(uid, 10)) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:39:7
-   		if (data.handle && !parseInt(uid, 10)) {
+   		if (data.handle || !parseInt(uid, 10)) {

[Survived] BooleanLiteral
src/posts/create.js:39:22
-   		if (data.handle && !parseInt(uid, 10)) {
+   		if (data.handle && parseInt(uid, 10)) {

[Survived] BlockStatement
src/posts/create.js:39:42
-   		if (data.handle && !parseInt(uid, 10)) {
-   			postData.handle = data.handle;
-   		}
+   		if (data.handle && !parseInt(uid, 10)) {}

[Survived] ConditionalExpression
src/posts/create.js:42:7
-   		if (_activitypub) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:42:7
-   		if (_activitypub) {
+   		if (false) {

[Survived] BlockStatement
src/posts/create.js:42:21
-   		if (_activitypub) {
-   			if (_activitypub.url) {
-   				postData.url = _activitypub.url;
-   			}
-   			if (_activitypub.audience) {
-   				postData.audience = _activitypub.audience;
-   			}
-   		}
+   		if (_activitypub) {}

[Survived] ConditionalExpression
src/posts/create.js:43:8
-   			if (_activitypub.url) {
+   			if (true) {

[Survived] ConditionalExpression
src/posts/create.js:43:8
-   			if (_activitypub.url) {
+   			if (false) {

[Survived] BlockStatement
src/posts/create.js:43:26
-   			if (_activitypub.url) {
-   				postData.url = _activitypub.url;
-   			}
+   			if (_activitypub.url) {}

[Survived] ConditionalExpression
src/posts/create.js:46:8
-   			if (_activitypub.audience) {
+   			if (true) {

[Survived] ConditionalExpression
src/posts/create.js:46:8
-   			if (_activitypub.audience) {
+   			if (false) {

[Survived] BlockStatement
src/posts/create.js:46:31
-   			if (_activitypub.audience) {
-   				postData.audience = _activitypub.audience;
-   			}
+   			if (_activitypub.audience) {}

[Survived] ConditionalExpression
src/posts/create.js:52:7
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:52:7
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:52:7
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+   		if (_activitypub && _activitypub.tag || Array.isArray(_activitypub.tag)) {

[Survived] ConditionalExpression
src/posts/create.js:52:7
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+   		if (true && Array.isArray(_activitypub.tag)) {

[Survived] LogicalOperator
src/posts/create.js:52:7
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
+   		if (_activitypub || _activitypub.tag && Array.isArray(_activitypub.tag)) {

[Survived] BlockStatement
src/posts/create.js:52:76
-   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {
-   			_activitypub.tag
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
-   				.forEach((tag) => {
-   					if (!tag.name.startsWith(':')) {
-   						tag.name = `:${tag.name}`;
-   					}
-   					if (!tag.name.endsWith(':')) {
-   						tag.name = `${tag.name}:`;
-   					}
-   					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
-   				});
-   		}
+   		if (_activitypub && _activitypub.tag && Array.isArray(_activitypub.tag)) {}

[Survived] ArrowFunction
src/posts/create.js:54:13
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(() => undefined)

[Survived] MethodExpression
src/posts/create.js:53:4
-   			_activitypub.tag
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   			_activitypub.tag

[Survived] ConditionalExpression
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(tag => false)

[Survived] ConditionalExpression
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(tag => true)

[Survived] ConditionalExpression
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(tag => true && tag.icon.type === 'Image')

[Survived] LogicalOperator
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(tag => tag.type === 'Emoji' && tag.icon || tag.icon.type === 'Image')

[Survived] LogicalOperator
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
-   					tag.icon && tag.icon.type === 'Image')
+   				.filter(tag => tag.type === 'Emoji' || tag.icon && tag.icon.type === 'Image')

[Survived] ConditionalExpression
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
+   				.filter(tag => true &&

[Survived] EqualityOperator
src/posts/create.js:54:20
-   				.filter(tag => tag.type === 'Emoji' &&
+   				.filter(tag => tag.type !== 'Emoji' &&

[Survived] StringLiteral
src/posts/create.js:54:33
-   				.filter(tag => tag.type === 'Emoji' &&
+   				.filter(tag => tag.type === "" &&

[Survived] ConditionalExpression
src/posts/create.js:55:18
-   					tag.icon && tag.icon.type === 'Image')
+   					tag.icon && true)

[Survived] StringLiteral
src/posts/create.js:55:36
-   					tag.icon && tag.icon.type === 'Image')
+   					tag.icon && tag.icon.type === "")

[Survived] EqualityOperator
src/posts/create.js:55:18
-   					tag.icon && tag.icon.type === 'Image')
+   					tag.icon && tag.icon.type !== 'Image')

[Survived] BlockStatement
src/posts/create.js:56:23
-   				.forEach((tag) => {
-   					if (!tag.name.startsWith(':')) {
-   						tag.name = `:${tag.name}`;
-   					}
-   					if (!tag.name.endsWith(':')) {
-   						tag.name = `${tag.name}:`;
-   					}
-   					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
-   				});
+   				.forEach((tag) => {});

[Survived] BooleanLiteral
src/posts/create.js:57:10
-   					if (!tag.name.startsWith(':')) {
+   					if (tag.name.startsWith(':')) {

[Survived] ConditionalExpression
src/posts/create.js:57:10
-   					if (!tag.name.startsWith(':')) {
+   					if (false) {

[Survived] ConditionalExpression
src/posts/create.js:57:10
-   					if (!tag.name.startsWith(':')) {
+   					if (true) {

[Survived] MethodExpression
src/posts/create.js:57:11
-   					if (!tag.name.startsWith(':')) {
+   					if (!tag.name.endsWith(':')) {

[Survived] StringLiteral
src/posts/create.js:57:31
-   					if (!tag.name.startsWith(':')) {
+   					if (!tag.name.startsWith("")) {

[Survived] BlockStatement
src/posts/create.js:57:37
-   					if (!tag.name.startsWith(':')) {
-   						tag.name = `:${tag.name}`;
-   					}
+   					if (!tag.name.startsWith(':')) {}

[Survived] BooleanLiteral
src/posts/create.js:60:10
-   					if (!tag.name.endsWith(':')) {
+   					if (tag.name.endsWith(':')) {

[Survived] StringLiteral
src/posts/create.js:58:18
-   						tag.name = `:${tag.name}`;
+   						tag.name = ``;

[Survived] ConditionalExpression
src/posts/create.js:60:10
-   					if (!tag.name.endsWith(':')) {
+   					if (false) {

[Survived] ConditionalExpression
src/posts/create.js:60:10
-   					if (!tag.name.endsWith(':')) {
+   					if (true) {

[Survived] StringLiteral
src/posts/create.js:60:29
-   					if (!tag.name.endsWith(':')) {
+   					if (!tag.name.endsWith("")) {

[Survived] MethodExpression
src/posts/create.js:60:11
-   					if (!tag.name.endsWith(':')) {
+   					if (!tag.name.startsWith(':')) {

[Survived] StringLiteral
src/posts/create.js:61:18
-   						tag.name = `${tag.name}:`;
+   						tag.name = ``;

[Survived] BlockStatement
src/posts/create.js:60:35
-   					if (!tag.name.endsWith(':')) {
-   						tag.name = `${tag.name}:`;
-   					}
+   					if (!tag.name.endsWith(':')) {}

[Survived] StringLiteral
src/posts/create.js:64:71
-   					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
+   					postData.content = postData.content.replace(new RegExp(tag.name, ""), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);

[Survived] StringLiteral
src/posts/create.js:64:77
-   					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), `<img class="not-responsive emoji" src="${tag.icon.url}" title="${tag.name}" />`);
+   					postData.content = postData.content.replace(new RegExp(tag.name, 'g'), ``);

[Survived] StringLiteral
src/posts/create.js:68:50
-   		({ post: postData } = await plugins.hooks.fire('filter:post.create', { post: postData, data: data }));
+   		({ post: postData } = await plugins.hooks.fire("", { post: postData, data: data }));

[Survived] ObjectLiteral
src/posts/create.js:68:72
-   		({ post: postData } = await plugins.hooks.fire('filter:post.create', { post: postData, data: data }));
+   		({ post: postData } = await plugins.hooks.fire('filter:post.create', {}));

[Survived] StringLiteral
src/posts/create.js:69:22
-   		await db.setObject(`post:${postData.pid}`, postData);
+   		await db.setObject(``, postData);

[Survived] ArrayDeclaration
src/posts/create.js:71:54
-   		const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(tid, []);

[Survived] StringLiteral
src/posts/create.js:71:55
-   		const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(tid, ["", 'pinned']);

[Survived] StringLiteral
src/posts/create.js:71:62
-   		const topicData = await topics.getTopicFields(tid, ['cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(tid, ['cid', ""]);

[Survived] ArrayDeclaration
src/posts/create.js:74:21
-   		await Promise.all([
-   			db.sortedSetAdd('posts:pid', timestamp, postData.pid),
-   			utils.isNumber(pid) ? db.incrObjectField('global', 'postCount') : null,
-   			user.onNewPostMade(postData),
-   			topics.onNewPostMade(postData),
-   			categories.onNewPostMade(topicData.cid, topicData.pinned, postData),
-   			groups.onNewPostMade(postData),
-   			addReplyTo(postData, timestamp),
-   			Posts.uploads.sync(postData.pid),
-   		]);
+   		await Promise.all([]);

[Survived] StringLiteral
src/posts/create.js:75:20
-   			db.sortedSetAdd('posts:pid', timestamp, postData.pid),
+   			db.sortedSetAdd("", timestamp, postData.pid),

[Survived] StringLiteral
src/posts/create.js:85:43
-   		const result = await plugins.hooks.fire('filter:post.get', { post: postData, uid: data.uid });
+   		const result = await plugins.hooks.fire("", { post: postData, uid: data.uid });

[Survived] ObjectLiteral
src/posts/create.js:85:62
-   		const result = await plugins.hooks.fire('filter:post.get', { post: postData, uid: data.uid });
+   		const result = await plugins.hooks.fire('filter:post.get', {});

[Survived] StringLiteral
src/posts/create.js:87:22
-   		plugins.hooks.fire('action:post.save', { post: { ...result.post, _activitypub } });
+   		plugins.hooks.fire("", { post: { ...result.post, _activitypub } });

[Survived] ObjectLiteral
src/posts/create.js:87:42
-   		plugins.hooks.fire('action:post.save', { post: { ...result.post, _activitypub } });
+   		plugins.hooks.fire('action:post.save', {});

[Survived] ObjectLiteral
src/posts/create.js:87:50
-   		plugins.hooks.fire('action:post.save', { post: { ...result.post, _activitypub } });
+   		plugins.hooks.fire('action:post.save', { post: {} });

[Survived] BlockStatement
src/posts/create.js:91:49
-   	async function addReplyTo(postData, timestamp) {
-   		if (!postData.toPid) {
-   			return;
-   		}
-   		await Promise.all([
-   			db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-   			db.incrObjectField(`post:${postData.toPid}`, 'replies'),
-   		]);
-   	}
+   	async function addReplyTo(postData, timestamp) {}

[Survived] BooleanLiteral
src/posts/create.js:92:7
-   		if (!postData.toPid) {
+   		if (postData.toPid) {

[Survived] ConditionalExpression
src/posts/create.js:92:7
-   		if (!postData.toPid) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:92:7
-   		if (!postData.toPid) {
+   		if (false) {

[Survived] BlockStatement
src/posts/create.js:92:24
-   		if (!postData.toPid) {
-   			return;
-   		}
+   		if (!postData.toPid) {}

[Survived] ArrayDeclaration
src/posts/create.js:95:21
-   		await Promise.all([
-   			db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
-   			db.incrObjectField(`post:${postData.toPid}`, 'replies'),
-   		]);
+   		await Promise.all([]);

[Survived] StringLiteral
src/posts/create.js:96:20
-   			db.sortedSetAdd(`pid:${postData.toPid}:replies`, timestamp, postData.pid),
+   			db.sortedSetAdd(``, timestamp, postData.pid),

[Survived] ConditionalExpression
src/posts/create.js:102:7
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:102:7
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:102:7
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+   		if (!utils.isNumber(toPid) || !activitypub.helpers.isUri(toPid)) {

[Survived] BooleanLiteral
src/posts/create.js:102:7
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+   		if (utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {

[Survived] BooleanLiteral
src/posts/create.js:102:33
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
+   		if (!utils.isNumber(toPid) && activitypub.helpers.isUri(toPid)) {

[Survived] BlockStatement
src/posts/create.js:102:68
-   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {
-   			throw new Error('[[error:invalid-pid]]');
-   		}
+   		if (!utils.isNumber(toPid) && !activitypub.helpers.isUri(toPid)) {}

[Survived] StringLiteral
src/posts/create.js:103:20
-   			throw new Error('[[error:invalid-pid]]');
+   			throw new Error("");

[Survived] ArrayDeclaration
src/posts/create.js:107:31
-   			Posts.getPostFields(toPid, ['pid', 'deleted']),
+   			Posts.getPostFields(toPid, []),

[Survived] StringLiteral
src/posts/create.js:107:32
-   			Posts.getPostFields(toPid, ['pid', 'deleted']),
+   			Posts.getPostFields(toPid, ["", 'deleted']),

[Survived] StringLiteral
src/posts/create.js:107:39
-   			Posts.getPostFields(toPid, ['pid', 'deleted']),
+   			Posts.getPostFields(toPid, ['pid', ""]),

[Survived] BooleanLiteral
src/posts/create.js:110:23
-   		const toPidExists = !!toPost.pid;
+   		const toPidExists = !toPost.pid;

[Survived] BooleanLiteral
src/posts/create.js:110:24
-   		const toPidExists = !!toPost.pid;
+   		const toPidExists = !toPost.pid;

[Survived] ConditionalExpression
src/posts/create.js:111:7
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/create.js:111:7
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/create.js:111:7
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (!toPidExists && toPost.deleted && !canViewToPid) {

[Survived] BooleanLiteral
src/posts/create.js:111:7
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (toPidExists || (toPost.deleted && !canViewToPid)) {

[Survived] ConditionalExpression
src/posts/create.js:111:24
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (!toPidExists || (false)) {

[Survived] LogicalOperator
src/posts/create.js:111:24
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (!toPidExists || (toPost.deleted || !canViewToPid)) {

[Survived] BooleanLiteral
src/posts/create.js:111:42
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
+   		if (!toPidExists || (toPost.deleted && canViewToPid)) {

[Survived] BlockStatement
src/posts/create.js:111:58
-   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {
-   			throw new Error('[[error:invalid-pid]]');
-   		}
+   		if (!toPidExists || (toPost.deleted && !canViewToPid)) {}

[Survived] StringLiteral
src/posts/create.js:112:20
-   			throw new Error('[[error:invalid-pid]]');
+   			throw new Error("");

[Survived] ArrayDeclaration
src/posts/data.js:7:19
-   const intFields = [
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
-   	'upvotes', 'downvotes', 'deleterUid', 'edited',
-   	'replies', 'bookmarks', 'announces',
-   ];
+   const intFields = [];

[Survived] StringLiteral
src/posts/data.js:8:2
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+   	"", 'pid', 'tid', 'deleted', 'timestamp',

[Survived] StringLiteral
src/posts/data.js:8:9
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+   	'uid', "", 'tid', 'deleted', 'timestamp',

[Survived] StringLiteral
src/posts/data.js:8:16
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+   	'uid', 'pid', "", 'deleted', 'timestamp',

[Survived] StringLiteral
src/posts/data.js:8:23
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+   	'uid', 'pid', 'tid', "", 'timestamp',

[Survived] StringLiteral
src/posts/data.js:8:34
-   	'uid', 'pid', 'tid', 'deleted', 'timestamp',
+   	'uid', 'pid', 'tid', 'deleted', "",

[Survived] StringLiteral
src/posts/data.js:9:13
-   	'upvotes', 'downvotes', 'deleterUid', 'edited',
+   	'upvotes', "", 'deleterUid', 'edited',

[Survived] StringLiteral
src/posts/data.js:9:2
-   	'upvotes', 'downvotes', 'deleterUid', 'edited',
+   	"", 'downvotes', 'deleterUid', 'edited',

[Survived] StringLiteral
src/posts/data.js:9:26
-   	'upvotes', 'downvotes', 'deleterUid', 'edited',
+   	'upvotes', 'downvotes', "", 'edited',

[Survived] StringLiteral
src/posts/data.js:9:40
-   	'upvotes', 'downvotes', 'deleterUid', 'edited',
+   	'upvotes', 'downvotes', 'deleterUid', "",

[Survived] StringLiteral
src/posts/data.js:10:13
-   	'replies', 'bookmarks', 'announces',
+   	'replies', "", 'announces',

[Survived] StringLiteral
src/posts/data.js:10:2
-   	'replies', 'bookmarks', 'announces',
+   	"", 'bookmarks', 'announces',

[Survived] StringLiteral
src/posts/data.js:10:26
-   	'replies', 'bookmarks', 'announces',
+   	'replies', 'bookmarks', "",

[Survived] BlockStatement
src/posts/data.js:14:55
-   	Posts.getPostsFields = async function (pids, fields) {
-   		if (!Array.isArray(pids) || !pids.length) {
-   			return [];
-   		}
-   		const keys = pids.map(pid => `post:${pid}`);
-   		const postData = await db.getObjects(keys, fields);
-   		const result = await plugins.hooks.fire('filter:post.getFields', {
-   			pids: pids,
-   			posts: postData,
-   			fields: fields,
-   		});
-   		result.posts.forEach(post => modifyPost(post, fields));
-   		return result.posts;
-   	};
+   	Posts.getPostsFields = async function (pids, fields) {};

[Survived] ConditionalExpression
src/posts/data.js:15:7
-   		if (!Array.isArray(pids) || !pids.length) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/data.js:15:7
-   		if (!Array.isArray(pids) || !pids.length) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/data.js:15:7
-   		if (!Array.isArray(pids) || !pids.length) {
+   		if (!Array.isArray(pids) && !pids.length) {

[Survived] BooleanLiteral
src/posts/data.js:15:31
-   		if (!Array.isArray(pids) || !pids.length) {
+   		if (!Array.isArray(pids) || pids.length) {

[Survived] BooleanLiteral
src/posts/data.js:15:7
-   		if (!Array.isArray(pids) || !pids.length) {
+   		if (Array.isArray(pids) || !pids.length) {

[Survived] BlockStatement
src/posts/data.js:15:45
-   		if (!Array.isArray(pids) || !pids.length) {
-   			return [];
-   		}
+   		if (!Array.isArray(pids) || !pids.length) {}

[Survived] ArrowFunction
src/posts/data.js:18:25
-   		const keys = pids.map(pid => `post:${pid}`);
+   		const keys = pids.map(() => undefined);

[Survived] ArrayDeclaration
src/posts/data.js:16:11
-   			return [];
+   			return ["Stryker was here"];

[Survived] StringLiteral
src/posts/data.js:18:32
-   		const keys = pids.map(pid => `post:${pid}`);
+   		const keys = pids.map(pid => ``);

[Survived] StringLiteral
src/posts/data.js:20:43
-   		const result = await plugins.hooks.fire('filter:post.getFields', {
+   		const result = await plugins.hooks.fire("", {

[Survived] ObjectLiteral
src/posts/data.js:20:68
-   		const result = await plugins.hooks.fire('filter:post.getFields', {
-   			pids: pids,
-   			posts: postData,
-   			fields: fields,
-   		});
+   		const result = await plugins.hooks.fire('filter:post.getFields', {});

[Survived] ArrowFunction
src/posts/data.js:25:24
-   		result.posts.forEach(post => modifyPost(post, fields));
+   		result.posts.forEach(() => undefined);

[Survived] BlockStatement
src/posts/data.js:29:43
-   	Posts.getPostData = async function (pid) {
-   		const posts = await Posts.getPostsFields([pid], []);
-   		return posts && posts.length ? posts[0] : null;
-   	};
+   	Posts.getPostData = async function (pid) {};

[Survived] ArrayDeclaration
src/posts/data.js:30:44
-   		const posts = await Posts.getPostsFields([pid], []);
+   		const posts = await Posts.getPostsFields([], []);

[Survived] ArrayDeclaration
src/posts/data.js:30:51
-   		const posts = await Posts.getPostsFields([pid], []);
+   		const posts = await Posts.getPostsFields([pid], ["Stryker was here"]);

[Survived] ConditionalExpression
src/posts/data.js:31:10
-   		return posts && posts.length ? posts[0] : null;
+   		return true ? posts[0] : null;

[Survived] ConditionalExpression
src/posts/data.js:31:10
-   		return posts && posts.length ? posts[0] : null;
+   		return false ? posts[0] : null;

[Survived] LogicalOperator
src/posts/data.js:31:10
-   		return posts && posts.length ? posts[0] : null;
+   		return posts || posts.length ? posts[0] : null;

[Survived] BlockStatement
src/posts/data.js:34:45
-   	Posts.getPostsData = async function (pids) {
-   		return await Posts.getPostsFields(pids, []);
-   	};
+   	Posts.getPostsData = async function (pids) {};

[Survived] ArrayDeclaration
src/posts/data.js:35:43
-   		return await Posts.getPostsFields(pids, []);
+   		return await Posts.getPostsFields(pids, ["Stryker was here"]);

[Survived] BlockStatement
src/posts/data.js:38:51
-   	Posts.getPostField = async function (pid, field) {
-   		const post = await Posts.getPostFields(pid, [field]);
-   		return post && post.hasOwnProperty(field) ? post[field] : null;
-   	};
+   	Posts.getPostField = async function (pid, field) {};

[Survived] ConditionalExpression
src/posts/data.js:40:10
-   		return post && post.hasOwnProperty(field) ? post[field] : null;
+   		return true ? post[field] : null;

[Survived] ArrayDeclaration
src/posts/data.js:39:47
-   		const post = await Posts.getPostFields(pid, [field]);
+   		const post = await Posts.getPostFields(pid, []);

[Survived] LogicalOperator
src/posts/data.js:40:10
-   		return post && post.hasOwnProperty(field) ? post[field] : null;
+   		return post || post.hasOwnProperty(field) ? post[field] : null;

[Survived] ConditionalExpression
src/posts/data.js:40:10
-   		return post && post.hasOwnProperty(field) ? post[field] : null;
+   		return false ? post[field] : null;

[Survived] BlockStatement
src/posts/data.js:43:53
-   	Posts.getPostFields = async function (pid, fields) {
-   		const posts = await Posts.getPostsFields([pid], fields);
-   		return posts ? posts[0] : null;
-   	};
+   	Posts.getPostFields = async function (pid, fields) {};

[Survived] ArrayDeclaration
src/posts/data.js:44:44
-   		const posts = await Posts.getPostsFields([pid], fields);
+   		const posts = await Posts.getPostsFields([], fields);

[Survived] BlockStatement
src/posts/data.js:48:58
-   	Posts.setPostField = async function (pid, field, value) {
-   		await Posts.setPostFields(pid, { [field]: value });
-   	};
+   	Posts.setPostField = async function (pid, field, value) {};

[Survived] ObjectLiteral
src/posts/data.js:49:34
-   		await Posts.setPostFields(pid, { [field]: value });
+   		await Posts.setPostFields(pid, {});

[Survived] BlockStatement
src/posts/data.js:52:51
-   	Posts.setPostFields = async function (pid, data) {
-   		await db.setObject(`post:${pid}`, data);
-   		plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
-   	};
+   	Posts.setPostFields = async function (pid, data) {};

[Survived] StringLiteral
src/posts/data.js:53:22
-   		await db.setObject(`post:${pid}`, data);
+   		await db.setObject(``, data);

[Survived] StringLiteral
src/posts/data.js:54:22
-   		plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
+   		plugins.hooks.fire("", { data: { ...data, pid } });

[Survived] ObjectLiteral
src/posts/data.js:54:47
-   		plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
+   		plugins.hooks.fire('action:post.setFields', {});

[Survived] ObjectLiteral
src/posts/data.js:54:55
-   		plugins.hooks.fire('action:post.setFields', { data: { ...data, pid } });
+   		plugins.hooks.fire('action:post.setFields', { data: {} });

[Survived] BlockStatement
src/posts/data.js:58:35
-   function modifyPost(post, fields) {
-   	if (post) {
-   		db.parseIntFields(post, intFields, fields);
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-   			post.votes = post.upvotes - post.downvotes;
-   		}
-   		if (post.hasOwnProperty('timestamp')) {
-   			post.timestampISO = utils.toISOString(post.timestamp);
-   		}
-   		if (post.hasOwnProperty('edited')) {
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-   		}
-   		if (!fields.length || fields.includes('attachments')) {
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
-   		}
-   	}
-   }
+   function modifyPost(post, fields) {}
