[Survived] ConditionalExpression
src/posts/data.js:59:6
-   	if (post) {
+   	if (true) {

[Survived] ConditionalExpression
src/posts/data.js:59:6
-   	if (post) {
+   	if (false) {

[Survived] BlockStatement
src/posts/data.js:59:12
-   	if (post) {
-   		db.parseIntFields(post, intFields, fields);
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-   			post.votes = post.upvotes - post.downvotes;
-   		}
-   		if (post.hasOwnProperty('timestamp')) {
-   			post.timestampISO = utils.toISOString(post.timestamp);
-   		}
-   		if (post.hasOwnProperty('edited')) {
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-   		}
-   		if (!fields.length || fields.includes('attachments')) {
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
-   		}
-   	}
+   	if (post) {}

[Survived] ConditionalExpression
src/posts/data.js:61:7
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/data.js:61:7
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/data.js:61:7
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+   		if (post.hasOwnProperty('upvotes') || post.hasOwnProperty('downvotes')) {

[Survived] StringLiteral
src/posts/data.js:61:27
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+   		if (post.hasOwnProperty("") && post.hasOwnProperty('downvotes')) {

[Survived] StringLiteral
src/posts/data.js:61:61
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
+   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty("")) {

[Survived] BlockStatement
src/posts/data.js:61:75
-   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {
-   			post.votes = post.upvotes - post.downvotes;
-   		}
+   		if (post.hasOwnProperty('upvotes') && post.hasOwnProperty('downvotes')) {}

[Survived] ArithmeticOperator
src/posts/data.js:62:17
-   			post.votes = post.upvotes - post.downvotes;
+   			post.votes = post.upvotes + post.downvotes;

[Survived] ConditionalExpression
src/posts/data.js:64:7
-   		if (post.hasOwnProperty('timestamp')) {
+   		if (true) {

[Survived] StringLiteral
src/posts/data.js:64:27
-   		if (post.hasOwnProperty('timestamp')) {
+   		if (post.hasOwnProperty("")) {

[Survived] ConditionalExpression
src/posts/data.js:64:7
-   		if (post.hasOwnProperty('timestamp')) {
+   		if (false) {

[Survived] BlockStatement
src/posts/data.js:64:41
-   		if (post.hasOwnProperty('timestamp')) {
-   			post.timestampISO = utils.toISOString(post.timestamp);
-   		}
+   		if (post.hasOwnProperty('timestamp')) {}

[Survived] ConditionalExpression
src/posts/data.js:67:7
-   		if (post.hasOwnProperty('edited')) {
+   		if (true) {

[Survived] StringLiteral
src/posts/data.js:67:27
-   		if (post.hasOwnProperty('edited')) {
+   		if (post.hasOwnProperty("")) {

[Survived] ConditionalExpression
src/posts/data.js:67:7
-   		if (post.hasOwnProperty('edited')) {
+   		if (false) {

[Survived] BlockStatement
src/posts/data.js:67:38
-   		if (post.hasOwnProperty('edited')) {
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
-   		}
+   		if (post.hasOwnProperty('edited')) {}

[Survived] ConditionalExpression
src/posts/data.js:68:21
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+   			post.editedISO = true ? utils.toISOString(post.edited) : '';

[Survived] ConditionalExpression
src/posts/data.js:68:21
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+   			post.editedISO = false ? utils.toISOString(post.edited) : '';

[Survived] EqualityOperator
src/posts/data.js:68:21
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+   			post.editedISO = post.edited === 0 ? utils.toISOString(post.edited) : '';

[Survived] StringLiteral
src/posts/data.js:68:74
-   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : '';
+   			post.editedISO = post.edited !== 0 ? utils.toISOString(post.edited) : "Stryker was here!";

[Survived] ConditionalExpression
src/posts/data.js:70:7
-   		if (!fields.length || fields.includes('attachments')) {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/data.js:70:7
-   		if (!fields.length || fields.includes('attachments')) {
+   		if (false) {

[Survived] LogicalOperator
src/posts/data.js:70:7
-   		if (!fields.length || fields.includes('attachments')) {
+   		if (!fields.length && fields.includes('attachments')) {

[Survived] BooleanLiteral
src/posts/data.js:70:7
-   		if (!fields.length || fields.includes('attachments')) {
+   		if (fields.length || fields.includes('attachments')) {

[Survived] StringLiteral
src/posts/data.js:70:41
-   		if (!fields.length || fields.includes('attachments')) {
+   		if (!fields.length || fields.includes("")) {

[Survived] BlockStatement
src/posts/data.js:70:57
-   		if (!fields.length || fields.includes('attachments')) {
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
-   		}
+   		if (!fields.length || fields.includes('attachments')) {}

[Survived] MethodExpression
src/posts/data.js:71:23
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (post.attachments || '').split(',');

[Survived] ConditionalExpression
src/posts/data.js:71:24
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (true).split(',').filter(Boolean);

[Survived] ConditionalExpression
src/posts/data.js:71:24
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (false).split(',').filter(Boolean);

[Survived] StringLiteral
src/posts/data.js:71:44
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (post.attachments || "Stryker was here!").split(',').filter(Boolean);

[Survived] LogicalOperator
src/posts/data.js:71:24
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (post.attachments && '').split(',').filter(Boolean);

[Survived] StringLiteral
src/posts/data.js:71:54
-   			post.attachments = (post.attachments || '').split(',').filter(Boolean);
+   			post.attachments = (post.attachments || '').split("").filter(Boolean);

[Survived] StringLiteral
src/posts/delete.js:17:32
-   		return await deleteOrRestore('delete', pid, uid);
+   		return await deleteOrRestore("", pid, uid);

[Survived] BlockStatement
src/posts/delete.js:16:43
-   	Posts.delete = async function (pid, uid) {
-   		return await deleteOrRestore('delete', pid, uid);
-   	};
+   	Posts.delete = async function (pid, uid) {};

[Survived] BlockStatement
src/posts/delete.js:20:44
-   	Posts.restore = async function (pid, uid) {
-   		return await deleteOrRestore('restore', pid, uid);
-   	};
+   	Posts.restore = async function (pid, uid) {};

[Survived] BlockStatement
src/posts/delete.js:24:49
-   	async function deleteOrRestore(type, pid, uid) {
-   		const isDeleting = type === 'delete';
-   		await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
-   		await Posts.setPostFields(pid, {
-   			deleted: isDeleting ? 1 : 0,
-   			deleterUid: isDeleting ? uid : 0,
-   		});
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
-   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
-   		postData.cid = topicData.cid;
-   		await Promise.all([
-   			topics.updateLastPostTimeFromLastPid(postData.tid),
-   			topics.updateTeaser(postData.tid),
-   			isDeleting ?
-   				db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
-   				db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
-   		]);
-   		await categories.updateRecentTidForCid(postData.cid);
-   		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
-   		if (type === 'delete') {
-   			await flags.resolveFlag('post', pid, uid);
-   		}
-   		return postData;
-   	}
+   	async function deleteOrRestore(type, pid, uid) {}

[Survived] StringLiteral
src/posts/delete.js:21:32
-   		return await deleteOrRestore('restore', pid, uid);
+   		return await deleteOrRestore("", pid, uid);

[Survived] ConditionalExpression
src/posts/delete.js:25:22
-   		const isDeleting = type === 'delete';
+   		const isDeleting = true;

[Survived] ConditionalExpression
src/posts/delete.js:25:22
-   		const isDeleting = type === 'delete';
+   		const isDeleting = false;

[Survived] EqualityOperator
src/posts/delete.js:25:22
-   		const isDeleting = type === 'delete';
+   		const isDeleting = type !== 'delete';

[Survived] StringLiteral
src/posts/delete.js:25:31
-   		const isDeleting = type === 'delete';
+   		const isDeleting = type === "";

[Survived] StringLiteral
src/posts/delete.js:26:28
-   		await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
+   		await plugins.hooks.fire(``, { pid: pid, uid: uid });

[Survived] ObjectLiteral
src/posts/delete.js:26:51
-   		await plugins.hooks.fire(`filter:post.${type}`, { pid: pid, uid: uid });
+   		await plugins.hooks.fire(`filter:post.${type}`, {});

[Survived] ObjectLiteral
src/posts/delete.js:27:34
-   		await Posts.setPostFields(pid, {
-   			deleted: isDeleting ? 1 : 0,
-   			deleterUid: isDeleting ? uid : 0,
-   		});
+   		await Posts.setPostFields(pid, {});

[Survived] ArrayDeclaration
src/posts/delete.js:31:51
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, []);

[Survived] StringLiteral
src/posts/delete.js:31:52
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ["", 'tid', 'uid', 'content', 'timestamp', 'deleted']);

[Survived] StringLiteral
src/posts/delete.js:31:59
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ['pid', "", 'uid', 'content', 'timestamp', 'deleted']);

[Survived] StringLiteral
src/posts/delete.js:31:66
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', "", 'content', 'timestamp', 'deleted']);

[Survived] StringLiteral
src/posts/delete.js:31:73
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', "", 'timestamp', 'deleted']);

[Survived] StringLiteral
src/posts/delete.js:31:84
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', "", 'deleted']);

[Survived] StringLiteral
src/posts/delete.js:31:97
-   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', 'deleted']);
+   		const postData = await Posts.getPostFields(pid, ['pid', 'tid', 'uid', 'content', 'timestamp', ""]);

[Survived] ArrayDeclaration
src/posts/delete.js:32:63
-   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(postData.tid, []);

[Survived] StringLiteral
src/posts/delete.js:32:64
-   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(postData.tid, ["", 'cid', 'pinned']);

[Survived] StringLiteral
src/posts/delete.js:32:71
-   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(postData.tid, ['tid', "", 'pinned']);

[Survived] StringLiteral
src/posts/delete.js:32:78
-   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', 'pinned']);
+   		const topicData = await topics.getTopicFields(postData.tid, ['tid', 'cid', ""]);

[Survived] ArrayDeclaration
src/posts/delete.js:34:21
-   		await Promise.all([
-   			topics.updateLastPostTimeFromLastPid(postData.tid),
-   			topics.updateTeaser(postData.tid),
-   			isDeleting ?
-   				db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
-   				db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
-   		]);
+   		await Promise.all([]);

[Survived] StringLiteral
src/posts/delete.js:38:24
-   				db.sortedSetRemove(`cid:${topicData.cid}:pids`, pid) :
+   				db.sortedSetRemove(``, pid) :

[Survived] StringLiteral
src/posts/delete.js:39:21
-   				db.sortedSetAdd(`cid:${topicData.cid}:pids`, postData.timestamp, pid),
+   				db.sortedSetAdd(``, postData.timestamp, pid),

[Survived] ObjectLiteral
src/posts/delete.js:42:45
-   		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
+   		plugins.hooks.fire(`action:post.${type}`, {});

[Survived] StringLiteral
src/posts/delete.js:42:22
-   		plugins.hooks.fire(`action:post.${type}`, { post: _.clone(postData), uid: uid });
+   		plugins.hooks.fire(``, { post: _.clone(postData), uid: uid });

[Survived] ConditionalExpression
src/posts/delete.js:43:7
-   		if (type === 'delete') {
+   		if (true) {

[Survived] ConditionalExpression
src/posts/delete.js:43:7
-   		if (type === 'delete') {
+   		if (false) {

[Survived] EqualityOperator
src/posts/delete.js:43:7
-   		if (type === 'delete') {
+   		if (type !== 'delete') {

[Survived] StringLiteral
src/posts/delete.js:43:16
-   		if (type === 'delete') {
+   		if (type === "") {

[Survived] BlockStatement
src/posts/delete.js:43:26
-   		if (type === 'delete') {
-   			await flags.resolveFlag('post', pid, uid);
-   		}
+   		if (type === 'delete') {}

[Survived] StringLiteral
src/posts/delete.js:44:28
-   			await flags.resolveFlag('post', pid, uid);
+   			await flags.resolveFlag("", pid, uid);

[Survived] ArrayDeclaration
src/posts/delete.js:50:39
-   		pids = Array.isArray(pids) ? pids : [pids];
+   		pids = Array.isArray(pids) ? pids : [];

[Survived] MethodExpression
src/posts/delete.js:52:10
-   		pids = pids.filter((pid, index) => !!postData[index]);
+   		pids = pids;

[Survived] ArrowFunction
src/posts/delete.js:52:22
-   		pids = pids.filter((pid, index) => !!postData[index]);
+   		pids = pids.filter(() => undefined);

[Survived] BooleanLiteral
src/posts/delete.js:52:38
-   		pids = pids.filter((pid, index) => !!postData[index]);
+   		pids = pids.filter((pid, index) => !postData[index]);

[Survived] BooleanLiteral
src/posts/delete.js:52:39
-   		pids = pids.filter((pid, index) => !!postData[index]);
+   		pids = pids.filter((pid, index) => !postData[index]);

[Survived] MethodExpression
src/posts/delete.js:53:14
-   		postData = postData.filter(Boolean);
+   		postData = postData;

[Survived] ConditionalExpression
src/posts/delete.js:54:7
-   		if (!postData.length) {
+   		if (true) {

[Survived] BooleanLiteral
src/posts/delete.js:54:7
-   		if (!postData.length) {
+   		if (postData.length) {

[Survived] ConditionalExpression
src/posts/delete.js:54:7
-   		if (!postData.length) {
+   		if (false) {

[Survived] BlockStatement
src/posts/delete.js:54:25
-   		if (!postData.length) {
-   			return;
-   		}
+   		if (!postData.length) {}

[Survived] ArrowFunction
src/posts/delete.js:57:40
-   		const uniqTids = _.uniq(postData.map(p => p.tid));
+   		const uniqTids = _.uniq(postData.map(() => undefined));

[Survived] StringLiteral
src/posts/delete.js:58:61
-   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+   		const topicData = await topics.getTopicsFields(uniqTids, ["", 'cid', 'pinned', 'postcount']);

[Survived] ArrayDeclaration
src/posts/delete.js:58:60
-   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+   		const topicData = await topics.getTopicsFields(uniqTids, []);

[Survived] StringLiteral
src/posts/delete.js:58:68
-   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', "", 'pinned', 'postcount']);

[Survived] StringLiteral
src/posts/delete.js:58:75
-   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', "", 'postcount']);

[Survived] StringLiteral
src/posts/delete.js:58:85
-   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', 'postcount']);
+   		const topicData = await topics.getTopicsFields(uniqTids, ['tid', 'cid', 'pinned', ""]);

[Survived] BlockStatement
src/posts/delete.js:61:27
-   		postData.forEach((p) => {
-   			p.topic = tidToTopic[p.tid];
-   			p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
-   		});
+   		postData.forEach((p) => {});

[Survived] ConditionalExpression
src/posts/delete.js:63:12
-   			p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+   			p.cid = false;

[Survived] ConditionalExpression
src/posts/delete.js:63:12
-   			p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+   			p.cid = true;

[Survived] LogicalOperator
src/posts/delete.js:63:12
-   			p.cid = tidToTopic[p.tid] && tidToTopic[p.tid].cid;
+   			p.cid = tidToTopic[p.tid] || tidToTopic[p.tid].cid;

[Survived] StringLiteral
src/posts/delete.js:66:28
-   		await plugins.hooks.fire('filter:posts.purge', {
+   		await plugins.hooks.fire("", {

[Survived] ObjectLiteral
src/posts/delete.js:66:50
-   		await plugins.hooks.fire('filter:posts.purge', {
-   			posts: postData,
-   			pids: postData.map(p => p.pid),
-   			uid: uid,
-   		});
+   		await plugins.hooks.fire('filter:posts.purge', {});

[Survived] ArrowFunction
src/posts/delete.js:68:23
-   			pids: postData.map(p => p.pid),
+   			pids: postData.map(() => undefined),

[Survived] ArrayDeclaration
src/posts/delete.js:72:21
-   		await Promise.all([
-   			deleteFromTopicUserNotification(postData),
-   			deleteFromCategoryRecentPosts(postData),
-   			deleteFromUsersBookmarks(pids),
-   			deleteFromUsersVotes(pids),
-   			deleteFromReplies(postData),
-   			deleteFromGroups(pids),
-   			deleteDiffs(pids),
-   			deleteFromUploads(pids),
-   			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
-   			Posts.attachments.empty(pids),
-   			activitypub.notes.delete(pids),
-   			db.deleteAll(pids.map(pid => `pid:${pid}:editors`)),
-   		]);
+   		await Promise.all([]);

[Survived] ArrayDeclaration
src/posts/delete.js:81:24
-   			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
+   			db.sortedSetsRemove([], pids),

[Survived] StringLiteral
src/posts/delete.js:81:25
-   			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
+   			db.sortedSetsRemove(["", 'posts:votes', 'posts:flagged'], pids),

[Survived] StringLiteral
src/posts/delete.js:81:53
-   			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
+   			db.sortedSetsRemove(['posts:pid', 'posts:votes', ""], pids),

[Survived] StringLiteral
src/posts/delete.js:81:38
-   			db.sortedSetsRemove(['posts:pid', 'posts:votes', 'posts:flagged'], pids),
+   			db.sortedSetsRemove(['posts:pid', "", 'posts:flagged'], pids),

[Survived] ArrowFunction
src/posts/delete.js:84:26
-   			db.deleteAll(pids.map(pid => `pid:${pid}:editors`)),
+   			db.deleteAll(pids.map(() => undefined)),

[Survived] StringLiteral
src/posts/delete.js:84:33
-   			db.deleteAll(pids.map(pid => `pid:${pid}:editors`)),
+   			db.deleteAll(pids.map(pid => ``)),

[Survived] StringLiteral
src/posts/delete.js:89:22
-   		plugins.hooks.fire('action:posts.purge', { posts: postData, uid: uid });
+   		plugins.hooks.fire("", { posts: postData, uid: uid });

[Survived] ObjectLiteral
src/posts/delete.js:89:44
-   		plugins.hooks.fire('action:posts.purge', { posts: postData, uid: uid });
+   		plugins.hooks.fire('action:posts.purge', {});

[Survived] ArrowFunction
src/posts/delete.js:91:35
-   		await db.deleteAll(postData.map(p => `post:${p.pid}`));
+   		await db.deleteAll(postData.map(() => undefined));

[Survived] StringLiteral
src/posts/delete.js:91:40
-   		await db.deleteAll(postData.map(p => `post:${p.pid}`));
+   		await db.deleteAll(postData.map(p => ``));

[Survived] ArrayDeclaration
src/posts/delete.js:95:22
-   		const bulkRemove = [];
+   		const bulkRemove = ["Stryker was here"];

[Survived] BlockStatement
src/posts/delete.js:96:27
-   		postData.forEach((p) => {
-   			bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
-   			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
-   			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
-   		});
+   		postData.forEach((p) => {});

[Survived] ArrayDeclaration
src/posts/delete.js:97:20
-   			bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
+   			bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:97:21
-   			bulkRemove.push([`tid:${p.tid}:posts`, p.pid]);
+   			bulkRemove.push([``, p.pid]);

[Survived] ArrayDeclaration
src/posts/delete.js:98:20
-   			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
+   			bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:98:21
-   			bulkRemove.push([`tid:${p.tid}:posts:votes`, p.pid]);
+   			bulkRemove.push([``, p.pid]);

[Survived] ArrayDeclaration
src/posts/delete.js:99:20
-   			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
+   			bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:99:21
-   			bulkRemove.push([`uid:${p.uid}:posts`, p.pid]);
+   			bulkRemove.push([``, p.pid]);

[Survived] ArrayDeclaration
src/posts/delete.js:100:20
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
+   			bulkRemove.push([]);

[Survived] ArrayDeclaration
src/posts/delete.js:101:20
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
+   			bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:100:21
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids`, p.pid]);
+   			bulkRemove.push([``, p.pid]);

[Survived] StringLiteral
src/posts/delete.js:101:21
-   			bulkRemove.push([`cid:${p.cid}:uid:${p.uid}:pids:votes`, p.pid]);
+   			bulkRemove.push([``, p.pid]);

[Survived] MethodExpression
src/posts/delete.js:105:22
-   		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
+   		const localCount = postData.length;

[Survived] ArrowFunction
src/posts/delete.js:105:38
-   		const localCount = postData.filter(p => utils.isNumber(p.pid)).length;
+   		const localCount = postData.filter(() => undefined).length;

[Survived] ArrayDeclaration
src/posts/delete.js:106:26
-   		const incrObjectBulk = [['global', { postCount: -localCount }]];
+   		const incrObjectBulk = [];

[Survived] ArrayDeclaration
src/posts/delete.js:106:27
-   		const incrObjectBulk = [['global', { postCount: -localCount }]];
+   		const incrObjectBulk = [[]];

[Survived] StringLiteral
src/posts/delete.js:106:28
-   		const incrObjectBulk = [['global', { postCount: -localCount }]];
+   		const incrObjectBulk = [["", { postCount: -localCount }]];

[Survived] ObjectLiteral
src/posts/delete.js:106:38
-   		const incrObjectBulk = [['global', { postCount: -localCount }]];
+   		const incrObjectBulk = [['global', {}]];

[Survived] UnaryOperator
src/posts/delete.js:106:51
-   		const incrObjectBulk = [['global', { postCount: -localCount }]];
+   		const incrObjectBulk = [['global', { postCount: +localCount }]];

[Survived] ArrowFunction
src/posts/delete.js:108:47
-   		const postsByCategory = _.groupBy(postData, p => parseInt(p.cid, 10));
+   		const postsByCategory = _.groupBy(postData, () => undefined);

[Survived] BlockStatement
src/posts/delete.js:109:63
-   		for (const [cid, posts] of Object.entries(postsByCategory)) {
-   			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
-   		}
+   		for (const [cid, posts] of Object.entries(postsByCategory)) {}

[Survived] ArrayDeclaration
src/posts/delete.js:110:24
-   			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+   			incrObjectBulk.push([]);

[Survived] StringLiteral
src/posts/delete.js:110:25
-   			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+   			incrObjectBulk.push([``, { post_count: -posts.length }]);

[Survived] ObjectLiteral
src/posts/delete.js:110:44
-   			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+   			incrObjectBulk.push([`category:${cid}`, {}]);

[Survived] UnaryOperator
src/posts/delete.js:110:58
-   			incrObjectBulk.push([`category:${cid}`, { post_count: -posts.length }]);
+   			incrObjectBulk.push([`category:${cid}`, { post_count: +posts.length }]);

[Survived] ArrowFunction
src/posts/delete.js:113:44
-   		const postsByTopic = _.groupBy(postData, p => String(p.tid));
+   		const postsByTopic = _.groupBy(postData, () => undefined);

[Survived] ArrayDeclaration
src/posts/delete.js:114:31
-   		const topicPostCountTasks = [];
+   		const topicPostCountTasks = ["Stryker was here"];

[Survived] ArrayDeclaration
src/posts/delete.js:116:24
-   		const zsetIncrBulk = [];
+   		const zsetIncrBulk = ["Stryker was here"];

[Survived] ArrayDeclaration
src/posts/delete.js:115:22
-   		const topicTasks = [];
+   		const topicTasks = ["Stryker was here"];

[Survived] ArrayDeclaration
src/posts/delete.js:117:16
-   		const tids = [];
+   		const tids = ["Stryker was here"];

[Survived] BlockStatement
src/posts/delete.js:118:60
-   		for (const [tid, posts] of Object.entries(postsByTopic)) {
-   			tids.push(tid);
-   			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
-   			if (posts.length && posts[0]) {
-   				const topicData = posts[0].topic;
-   				const newPostCount = topicData.postcount - posts.length;
-   				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-   				if (!topicData.pinned) {
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-   				}
-   			}
-   			topicTasks.push(topics.updateTeaser(tid));
-   			topicTasks.push(topics.updateLastPostTimeFromLastPid(tid));
-   			const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
-   			for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-   				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
-   			}
-   			topicTasks.push(db.sortedSetIncrByBulk(zsetIncrBulk));
-   		}
+   		for (const [tid, posts] of Object.entries(postsByTopic)) {}

[Survived] ArrayDeclaration
src/posts/delete.js:120:24
-   			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+   			incrObjectBulk.push([]);

[Survived] StringLiteral
src/posts/delete.js:120:25
-   			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+   			incrObjectBulk.push([``, { postcount: -posts.length }]);

[Survived] ObjectLiteral
src/posts/delete.js:120:41
-   			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+   			incrObjectBulk.push([`topic:${tid}`, {}]);

[Survived] UnaryOperator
src/posts/delete.js:120:54
-   			incrObjectBulk.push([`topic:${tid}`, { postcount: -posts.length }]);
+   			incrObjectBulk.push([`topic:${tid}`, { postcount: +posts.length }]);

[Survived] ConditionalExpression
src/posts/delete.js:121:8
-   			if (posts.length && posts[0]) {
+   			if (true) {

[Survived] ConditionalExpression
src/posts/delete.js:121:8
-   			if (posts.length && posts[0]) {
+   			if (false) {

[Survived] LogicalOperator
src/posts/delete.js:121:8
-   			if (posts.length && posts[0]) {
+   			if (posts.length || posts[0]) {

[Survived] BlockStatement
src/posts/delete.js:121:34
-   			if (posts.length && posts[0]) {
-   				const topicData = posts[0].topic;
-   				const newPostCount = topicData.postcount - posts.length;
-   				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
-   				if (!topicData.pinned) {
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-   				}
-   			}
+   			if (posts.length && posts[0]) {}

[Survived] ArithmeticOperator
src/posts/delete.js:123:26
-   				const newPostCount = topicData.postcount - posts.length;
+   				const newPostCount = topicData.postcount + posts.length;

[Survived] ArrayDeclaration
src/posts/delete.js:124:30
-   				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
+   				topicPostCountTasks.push([]);

[Survived] StringLiteral
src/posts/delete.js:124:31
-   				topicPostCountTasks.push(['topics:posts', newPostCount, tid]);
+   				topicPostCountTasks.push(["", newPostCount, tid]);

[Survived] BooleanLiteral
src/posts/delete.js:125:9
-   				if (!topicData.pinned) {
+   				if (topicData.pinned) {

[Survived] ConditionalExpression
src/posts/delete.js:125:9
-   				if (!topicData.pinned) {
+   				if (true) {

[Survived] ConditionalExpression
src/posts/delete.js:125:9
-   				if (!topicData.pinned) {
+   				if (false) {

[Survived] BlockStatement
src/posts/delete.js:125:28
-   				if (!topicData.pinned) {
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
-   				}
+   				if (!topicData.pinned) {}

[Survived] ArrayDeclaration
src/posts/delete.js:126:24
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
+   					zsetIncrBulk.push([]);
