[Survived] StringLiteral
src/posts/delete.js:126:25
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
+   					zsetIncrBulk.push([``, -posts.length, tid]);

[Survived] UnaryOperator
src/posts/delete.js:126:60
-   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, -posts.length, tid]);
+   					zsetIncrBulk.push([`cid:${topicData.cid}:tids:posts`, +posts.length, tid]);

[Survived] ArrowFunction
src/posts/delete.js:131:40
-   			const postsByUid = _.groupBy(posts, p => parseInt(p.uid, 10));
+   			const postsByUid = _.groupBy(posts, () => undefined);

[Survived] BlockStatement
src/posts/delete.js:132:62
-   			for (const [uid, uidPosts] of Object.entries(postsByUid)) {
-   				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
-   			}
+   			for (const [uid, uidPosts] of Object.entries(postsByUid)) {}

[Survived] ArrayDeclaration
src/posts/delete.js:133:23
-   				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
+   				zsetIncrBulk.push([]);

[Survived] UnaryOperator
src/posts/delete.js:133:46
-   				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
+   				zsetIncrBulk.push([`tid:${tid}:posters`, +uidPosts.length, uid]);

[Survived] StringLiteral
src/posts/delete.js:133:24
-   				zsetIncrBulk.push([`tid:${tid}:posters`, -uidPosts.length, uid]);
+   				zsetIncrBulk.push([``, -uidPosts.length, uid]);

[Survived] ArrowFunction
src/posts/delete.js:142:45
-   			user.updatePostCount(_.uniq(postData.map(p => p.uid))),
+   			user.updatePostCount(_.uniq(postData.map(() => undefined))),

[Survived] ArrowFunction
src/posts/delete.js:143:42
-   			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
+   			notifications.rescind(...postData.map(() => undefined)),

[Survived] StringLiteral
src/posts/delete.js:143:47
-   			notifications.rescind(...postData.map(p => `new_post:tid:${p.tid}:pid:${p.pid}:uid:${p.uid}`)),
+   			notifications.rescind(...postData.map(p => ``)),

[Survived] ArrowFunction
src/posts/delete.js:145:35
-   		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);
+   		const tidPosterZsets = tids.map(() => undefined);

[Survived] StringLiteral
src/posts/delete.js:145:42
-   		const tidPosterZsets = tids.map(tid => `tid:${tid}:posters`);
+   		const tidPosterZsets = tids.map(tid => ``);

[Survived] StringLiteral
src/posts/delete.js:146:57
-   		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, '-inf', 0);
+   		await db.sortedSetsRemoveRangeByScore(tidPosterZsets, "", 0);

[Survived] ArrowFunction
src/posts/delete.js:149:13
-   			tids.map((tid, idx) => (
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
-   			))
+   			tids.map(() => undefined)

[Survived] ArrayDeclaration
src/posts/delete.js:150:5
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[]

[Survived] StringLiteral
src/posts/delete.js:150:6
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[``, { postercount: posterCounts[idx] || 0 }]

[Survived] ObjectLiteral
src/posts/delete.js:150:22
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[`topic:${tid}`, {}]

[Survived] ConditionalExpression
src/posts/delete.js:150:37
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[`topic:${tid}`, { postercount: true }]

[Survived] ConditionalExpression
src/posts/delete.js:150:37
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[`topic:${tid}`, { postercount: false }]

[Survived] LogicalOperator
src/posts/delete.js:150:37
-   				[`topic:${tid}`, { postercount: posterCounts[idx] || 0 }]
+   				[`topic:${tid}`, { postercount: posterCounts[idx] && 0 }]

[Survived] BlockStatement
src/posts/delete.js:155:57
-   	async function deleteFromCategoryRecentPosts(postData) {
-   		const uniqCids = _.uniq(postData.map(p => p.cid));
-   		const sets = uniqCids.map(cid => `cid:${cid}:pids`);
-   		await db.sortedSetRemove(sets, postData.map(p => p.pid));
-   		await Promise.all(uniqCids.map(categories.updateRecentTidForCid));
-   	}
+   	async function deleteFromCategoryRecentPosts(postData) {}

[Survived] ArrowFunction
src/posts/delete.js:156:40
-   		const uniqCids = _.uniq(postData.map(p => p.cid));
+   		const uniqCids = _.uniq(postData.map(() => undefined));

[Survived] ArrowFunction
src/posts/delete.js:157:29
-   		const sets = uniqCids.map(cid => `cid:${cid}:pids`);
+   		const sets = uniqCids.map(() => undefined);

[Survived] StringLiteral
src/posts/delete.js:157:36
-   		const sets = uniqCids.map(cid => `cid:${cid}:pids`);
+   		const sets = uniqCids.map(cid => ``);

[Survived] ArrowFunction
src/posts/delete.js:158:47
-   		await db.sortedSetRemove(sets, postData.map(p => p.pid));
+   		await db.sortedSetRemove(sets, postData.map(() => undefined));

[Survived] BlockStatement
src/posts/delete.js:162:48
-   	async function deleteFromUsersBookmarks(pids) {
-   		const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
-   		const bulkRemove = [];
-   		pids.forEach((pid, index) => {
-   			arrayOfUids[index].forEach((uid) => {
-   				bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-   			});
-   		});
-   		await db.sortedSetRemoveBulk(bulkRemove);
-   		await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
-   	}
+   	async function deleteFromUsersBookmarks(pids) {}

[Survived] StringLiteral
src/posts/delete.js:163:63
-   		const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
+   		const arrayOfUids = await db.getSetsMembers(pids.map(pid => ``));

[Survived] ArrowFunction
src/posts/delete.js:163:56
-   		const arrayOfUids = await db.getSetsMembers(pids.map(pid => `pid:${pid}:users_bookmarked`));
+   		const arrayOfUids = await db.getSetsMembers(pids.map(() => undefined));

[Survived] ArrayDeclaration
src/posts/delete.js:164:22
-   		const bulkRemove = [];
+   		const bulkRemove = ["Stryker was here"];

[Survived] BlockStatement
src/posts/delete.js:165:32
-   		pids.forEach((pid, index) => {
-   			arrayOfUids[index].forEach((uid) => {
-   				bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-   			});
-   		});
+   		pids.forEach((pid, index) => {});

[Survived] BlockStatement
src/posts/delete.js:166:40
-   			arrayOfUids[index].forEach((uid) => {
-   				bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
-   			});
+   			arrayOfUids[index].forEach((uid) => {});

[Survived] ArrayDeclaration
src/posts/delete.js:167:21
-   				bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
+   				bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:167:22
-   				bulkRemove.push([`uid:${uid}:bookmarks`, pid]);
+   				bulkRemove.push([``, pid]);

[Survived] ArrowFunction
src/posts/delete.js:171:31
-   		await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
+   		await db.deleteAll(pids.map(() => undefined));

[Survived] StringLiteral
src/posts/delete.js:171:38
-   		await db.deleteAll(pids.map(pid => `pid:${pid}:users_bookmarked`));
+   		await db.deleteAll(pids.map(pid => ``));

[Survived] BlockStatement
src/posts/delete.js:174:44
-   	async function deleteFromUsersVotes(pids) {
-   		const [upvoters, downvoters] = await Promise.all([
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
-   		]);
-   		const bulkRemove = [];
-   		pids.forEach((pid, index) => {
-   			upvoters[index].forEach((upvoterUid) => {
-   				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-   			});
-   			downvoters[index].forEach((downvoterUid) => {
-   				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-   			});
-   		});
-   		await Promise.all([
-   			db.sortedSetRemoveBulk(bulkRemove),
-   			db.deleteAll([
-   				...pids.map(pid => `pid:${pid}:upvote`),
-   				...pids.map(pid => `pid:${pid}:downvote`),
-   			]),
-   		]);
-   	}
+   	async function deleteFromUsersVotes(pids) {}

[Survived] ArrayDeclaration
src/posts/delete.js:175:52
-   		const [upvoters, downvoters] = await Promise.all([
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
-   		]);
+   		const [upvoters, downvoters] = await Promise.all([]);

[Survived] ArrowFunction
src/posts/delete.js:176:31
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
+   			db.getSetsMembers(pids.map(() => undefined)),

[Survived] StringLiteral
src/posts/delete.js:176:38
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:upvote`)),
+   			db.getSetsMembers(pids.map(pid => ``)),

[Survived] ArrowFunction
src/posts/delete.js:177:31
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
+   			db.getSetsMembers(pids.map(() => undefined)),

[Survived] StringLiteral
src/posts/delete.js:177:38
-   			db.getSetsMembers(pids.map(pid => `pid:${pid}:downvote`)),
+   			db.getSetsMembers(pids.map(pid => ``)),

[Survived] ArrayDeclaration
src/posts/delete.js:179:22
-   		const bulkRemove = [];
+   		const bulkRemove = ["Stryker was here"];

[Survived] BlockStatement
src/posts/delete.js:180:32
-   		pids.forEach((pid, index) => {
-   			upvoters[index].forEach((upvoterUid) => {
-   				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-   			});
-   			downvoters[index].forEach((downvoterUid) => {
-   				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-   			});
-   		});
+   		pids.forEach((pid, index) => {});

[Survived] BlockStatement
src/posts/delete.js:181:44
-   			upvoters[index].forEach((upvoterUid) => {
-   				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
-   			});
+   			upvoters[index].forEach((upvoterUid) => {});

[Survived] ArrayDeclaration
src/posts/delete.js:182:21
-   				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
+   				bulkRemove.push([]);

[Survived] StringLiteral
src/posts/delete.js:182:22
-   				bulkRemove.push([`uid:${upvoterUid}:upvote`, pid]);
+   				bulkRemove.push([``, pid]);

[Survived] BlockStatement
src/posts/delete.js:184:48
-   			downvoters[index].forEach((downvoterUid) => {
-   				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
-   			});
+   			downvoters[index].forEach((downvoterUid) => {});

[Survived] StringLiteral
src/posts/delete.js:185:22
-   				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
+   				bulkRemove.push([``, pid]);

[Survived] ArrayDeclaration
src/posts/delete.js:185:21
-   				bulkRemove.push([`uid:${downvoterUid}:downvote`, pid]);
+   				bulkRemove.push([]);

[Survived] ArrayDeclaration
src/posts/delete.js:189:21
-   		await Promise.all([
-   			db.sortedSetRemoveBulk(bulkRemove),
-   			db.deleteAll([
-   				...pids.map(pid => `pid:${pid}:upvote`),
-   				...pids.map(pid => `pid:${pid}:downvote`),
-   			]),
-   		]);
+   		await Promise.all([]);

[Survived] ArrayDeclaration
src/posts/delete.js:191:17
-   			db.deleteAll([
-   				...pids.map(pid => `pid:${pid}:upvote`),
-   				...pids.map(pid => `pid:${pid}:downvote`),
-   			]),
+   			db.deleteAll([]),

[Survived] ArrowFunction
src/posts/delete.js:192:17
-   				...pids.map(pid => `pid:${pid}:upvote`),
+   				...pids.map(() => undefined),

[Survived] StringLiteral
src/posts/delete.js:192:24
-   				...pids.map(pid => `pid:${pid}:upvote`),
+   				...pids.map(pid => ``),

[Survived] ArrowFunction
src/posts/delete.js:193:17
-   				...pids.map(pid => `pid:${pid}:downvote`),
+   				...pids.map(() => undefined),

[Survived] StringLiteral
src/posts/delete.js:193:24
-   				...pids.map(pid => `pid:${pid}:downvote`),
+   				...pids.map(pid => ``),

[Survived] BlockStatement
src/posts/delete.js:198:45
-   	async function deleteFromReplies(postData) {
-   		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
-   		const allReplyPids = _.flatten(arrayOfReplyPids);
-   		const promises = [
-   			db.deleteObjectFields(
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
-   			),
-   			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
-   		];
-   		const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
-   		const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
-   		promises.push(db.sortedSetRemoveBulk(bulkRemove));
-   		await Promise.all(promises);
-   		const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
-   		const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
-   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
-   	}
+   	async function deleteFromReplies(postData) {}

[Survived] ArrowFunction
src/posts/delete.js:199:71
-   		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
+   		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(() => undefined));

[Survived] StringLiteral
src/posts/delete.js:199:76
-   		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => `pid:${p.pid}:replies`));
+   		const arrayOfReplyPids = await db.getSortedSetsMembers(postData.map(p => ``));

[Survived] ArrowFunction
src/posts/delete.js:203:22
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
+   				allReplyPids.map(() => undefined), ['toPid']

[Survived] StringLiteral
src/posts/delete.js:203:29
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
+   				allReplyPids.map(pid => ``), ['toPid']

[Survived] StringLiteral
src/posts/delete.js:203:46
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
+   				allReplyPids.map(pid => `post:${pid}`), [""]

[Survived] ArrayDeclaration
src/posts/delete.js:203:45
-   				allReplyPids.map(pid => `post:${pid}`), ['toPid']
+   				allReplyPids.map(pid => `post:${pid}`), []

[Survived] ArrowFunction
src/posts/delete.js:205:30
-   			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
+   			db.deleteAll(postData.map(() => undefined)),

[Survived] StringLiteral
src/posts/delete.js:205:35
-   			db.deleteAll(postData.map(p => `pid:${p.pid}:replies`)),
+   			db.deleteAll(postData.map(p => ``)),

[Survived] MethodExpression
src/posts/delete.js:208:28
-   		const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
+   		const postsWithParents = postData;

[Survived] ArrowFunction
src/posts/delete.js:208:44
-   		const postsWithParents = postData.filter(p => parseInt(p.toPid, 10));
+   		const postsWithParents = postData.filter(() => undefined);

[Survived] ArrowFunction
src/posts/delete.js:209:43
-   		const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
+   		const bulkRemove = postsWithParents.map(() => undefined);

[Survived] ArrayDeclaration
src/posts/delete.js:209:48
-   		const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
+   		const bulkRemove = postsWithParents.map(p => []);

[Survived] StringLiteral
src/posts/delete.js:209:49
-   		const bulkRemove = postsWithParents.map(p => [`pid:${p.toPid}:replies`, p.pid]);
+   		const bulkRemove = postsWithParents.map(p => [``, p.pid]);

[Survived] ArrowFunction
src/posts/delete.js:213:50
-   		const parentPids = _.uniq(postsWithParents.map(p => p.toPid));
+   		const parentPids = _.uniq(postsWithParents.map(() => undefined));

[Survived] ArrowFunction
src/posts/delete.js:214:57
-   		const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
+   		const counts = await db.sortedSetsCard(parentPids.map(() => undefined));

[Survived] StringLiteral
src/posts/delete.js:214:64
-   		const counts = await db.sortedSetsCard(parentPids.map(pid => `pid:${pid}:replies`));
+   		const counts = await db.sortedSetsCard(parentPids.map(pid => ``));

[Survived] ArrowFunction
src/posts/delete.js:215:41
-   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+   		await db.setObjectBulk(parentPids.map(() => undefined));

[Survived] ArrayDeclaration
src/posts/delete.js:215:57
-   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+   		await db.setObjectBulk(parentPids.map((pid, index) => []));

[Survived] StringLiteral
src/posts/delete.js:215:58
-   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+   		await db.setObjectBulk(parentPids.map((pid, index) => [``, { replies: counts[index] }]));

[Survived] ObjectLiteral
src/posts/delete.js:215:73
-   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, { replies: counts[index] }]));
+   		await db.setObjectBulk(parentPids.map((pid, index) => [`post:${pid}`, {}]));

[Survived] BlockStatement
src/posts/delete.js:218:40
-   	async function deleteFromGroups(pids) {
-   		const groupNames = await db.getSortedSetMembers('groups:visible:createtime');
-   		const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
-   		await db.sortedSetRemove(keys, pids);
-   	}
+   	async function deleteFromGroups(pids) {}

[Survived] StringLiteral
src/posts/delete.js:219:51
-   		const groupNames = await db.getSortedSetMembers('groups:visible:createtime');
+   		const groupNames = await db.getSortedSetMembers("");

[Survived] ArrowFunction
src/posts/delete.js:220:31
-   		const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
+   		const keys = groupNames.map(() => undefined);

[Survived] BlockStatement
src/posts/delete.js:224:35
-   	async function deleteDiffs(pids) {
-   		const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
-   		await db.deleteAll([
-   			...pids.map(pid => `post:${pid}:diffs`),
-   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
-   		]);
-   	}
+   	async function deleteDiffs(pids) {}

[Survived] StringLiteral
src/posts/delete.js:220:44
-   		const keys = groupNames.map(groupName => `group:${groupName}:member:pids`);
+   		const keys = groupNames.map(groupName => ``);

[Survived] ArrowFunction
src/posts/delete.js:225:49
-   		const timestamps = await Promise.all(pids.map(pid => Posts.diffs.list(pid)));
+   		const timestamps = await Promise.all(pids.map(() => undefined));

[Survived] ArrayDeclaration
src/posts/delete.js:226:22
-   		await db.deleteAll([
-   			...pids.map(pid => `post:${pid}:diffs`),
-   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
-   		]);
+   		await db.deleteAll([]);

[Survived] StringLiteral
src/posts/delete.js:227:23
-   			...pids.map(pid => `post:${pid}:diffs`),
+   			...pids.map(pid => ``),

[Survived] ArrowFunction
src/posts/delete.js:227:16
-   			...pids.map(pid => `post:${pid}:diffs`),
+   			...pids.map(() => undefined),

[Survived] ArrowFunction
src/posts/delete.js:228:30
-   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
+   			..._.flattenDeep(pids.map(() => undefined)),

[Survived] ArrowFunction
src/posts/delete.js:228:68
-   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
+   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(() => undefined))),

[Survived] StringLiteral
src/posts/delete.js:228:73
-   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => `diff:${pid}.${t}`))),
+   			..._.flattenDeep(pids.map((pid, index) => timestamps[index].map(t => ``))),

[Survived] BlockStatement
src/posts/delete.js:232:41
-   	async function deleteFromUploads(pids) {
-   		await Promise.all(pids.map(Posts.uploads.dissociateAll));
-   	}
+   	async function deleteFromUploads(pids) {}

[Survived] BlockStatement
src/posts/delete.js:236:45
-   	async function resolveFlags(postData, uid) {
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
-   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
-   	}
+   	async function resolveFlags(postData, uid) {}

[Survived] MethodExpression
src/posts/delete.js:237:24
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+   		const flaggedPosts = postData;

[Survived] ArrowFunction
src/posts/delete.js:237:40
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+   		const flaggedPosts = postData.filter(() => undefined);

[Survived] ConditionalExpression
src/posts/delete.js:237:45
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+   		const flaggedPosts = postData.filter(p => true);

[Survived] ConditionalExpression
src/posts/delete.js:237:45
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+   		const flaggedPosts = postData.filter(p => false);

[Survived] LogicalOperator
src/posts/delete.js:237:45
-   		const flaggedPosts = postData.filter(p => p && parseInt(p.flagId, 10));
+   		const flaggedPosts = postData.filter(p => p || parseInt(p.flagId, 10));

[Survived] ArrowFunction
src/posts/delete.js:238:38
-   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+   		await Promise.all(flaggedPosts.map(() => undefined));

[Survived] ObjectLiteral
src/posts/delete.js:238:71
-   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, {})));

[Survived] StringLiteral
src/posts/delete.js:238:80
-   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: 'resolved' })));
+   		await Promise.all(flaggedPosts.map(p => flags.update(p.flagId, uid, { state: "" })));
